[
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.receipt_id] [Type Confusion] Can an attacker provide an address that points to a non-receipt object, causing type errors or unexpected behavior when the vault attempts to access the receipt during cancellation or execution? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.receipt_id] [Cross-Vault Attack] Can receipt_id reference a receipt from a different vault, enabling an attacker to create withdrawal requests that drain shares from vaults other than the one processing the request? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.receipt_id] [Null Reference] If receipt_id is the zero address, does this cause null pointer-like errors when the vault tries to access or modify the receipt during request processing? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.recipient] [Recipient Mismatch] Can an attacker create a WithdrawRequest with recipient set to their address but receipt_id pointing to another user's receipt, bypassing ownership checks if the vault only validates receipt_id? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.recipient] [Zero Address] According to vault cancel logic, recipient can be address::from_u256(0) - can this be exploited to bypass recipient verification, allowing anyone to cancel others' withdrawal requests? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.recipient] [Recipient Substitution] Can an attacker modify the recipient address in a stored WithdrawRequest (if mutable reference is obtained), redirecting withdrawal proceeds to their address? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.recipient] [Contract Address] Can recipient be set to a contract address that could revert or consume excessive gas during withdrawal transfers, causing DoS for withdrawal execution? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.recipient] [Blacklisted Address] If the protocol implements address blacklisting, does recipient field lack validation against blacklists, allowing sanctioned addresses to withdraw through pre-created requests? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.vault_id] [Vault Mismatch] Can an attacker create a WithdrawRequest with vault_id pointing to a different vault than the one storing the request, causing cross-vault fund drainage during execution? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.vault_id] [Invalid Vault] If vault_id references a non-existent or deleted vault object, does this cause undefined behavior or allow bypassing vault-specific access controls? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.vault_id] [Vault Impersonation] Can an attacker spoof vault_id to make a malicious contract appear as a legitimate vault, tricking users into creating withdrawal requests to an attacker-controlled vault? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.vault_id] [Type Confusion] Does vault_id lack type safety to ensure it points to a Vault<T> object of the correct PrincipalCoinType, enabling type-mismatched withdrawals? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Share Inflation] Can an attacker create WithdrawRequest with shares exceeding their receipt's balance, then exploit a race condition where shares are minted after request creation but before execution? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Double Withdrawal] If shares are not immediately decremented from the receipt upon WithdrawRequest creation, can an attacker create multiple overlapping requests using the same shares? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Precision Loss] Does the u256 shares type risk precision loss when converted to or from u64-based calculations in vault execution, potentially causing rounding errors that favor attackers? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Minimum Withdrawal] Does lack of minimum shares validation allow dust attacks where countless tiny WithdrawRequest objects bloat the request buffer with negligible economic value? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Maximum Withdrawal] Can shares exceed vault's total_shares, creating a WithdrawRequest that's impossible to fulfill and permanently locks request buffer space? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Share Dilution] If vault mints new shares after WithdrawRequest creation, does the fixed shares value become unfairly diluted, violating user expectations for withdrawal value? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.shares] [Arithmetic Overflow] When shares is multiplied by share_ratio in execution logic, can this overflow if shares is near u256::max_value(), causing incorrect withdrawal amount calculations? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [Slippage Manipulation] Can an attacker set expected_amount artificially low to guarantee execution even after vault value drops, front-running legitimate withdrawals before losses are realized? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [DoS via High Expectation] Can an attacker set expected_amount artificially high (near u64::max_value()) to create withdrawal requests that always fail slippage checks, permanently locking their shares? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [Price Oracle Manipulation] If expected_amount is based on an oracle price at request creation time, can an attacker manipulate the oracle before creating WithdrawRequest to inflate expectations, then DoS execution when price normalizes? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [Stale Expectation] Can expected_amount become stale over time as market conditions change, causing legitimate withdrawal requests to fail due to outdated expectations? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [Type Overflow] Does u64 limit for expected_amount restrict large withdrawals in high-value vaults where share value exceeds u64 range? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest.expected_amount] [Fee Bypass] Can an attacker set expected_amount to exactly match pre-fee withdrawal amount, causing slippage checks to fail after fees are deducted, blocking all withdrawals? (Medium)"
]