[
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Version Check Bypass] If the version check at line 35 can be bypassed through a race condition where registry.version is modified between check and market creation, could an attacker create markets under an incompatible version causing state corruption? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Version Mismatch] Since CURRENT_VERSION is hardcoded to 1 at line 13, if the Registry is upgraded but CURRENT_VERSION isn't incremented, could old incompatible code continue creating markets in a new registry causing version skew vulnerabilities? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Struct: Registry] [Version Manipulation] If registry.version field (line 17) can be modified through a package upgrade without proper migration, could existing markets become inaccessible due to version assertion failures at line 35? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: init()] [Initial Version] Since init() sets version to CURRENT_VERSION (line 24) but there's no version upgrade mechanism, how can the protocol handle breaking changes without abandoning the existing Registry shared object? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Table Collision] Since table::add at line 38 will abort if type_name::get<P>() already exists in the table, but there's no check before calling lending_market::create_lending_market, could this cause a DoS where the newly created LendingMarket and LendingMarketOwnerCap are lost due to transaction failure? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Type Collision] If two different generic types P1 and P2 produce the same TypeName through type_name::get<P>() due to Move type system quirks or module name collisions, could an attacker prevent creation of legitimate markets by squatting on TypeName entries? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Orphaned Market] Since lending_market::create_lending_market is called at line 37 before table::add at line 38, if table::add fails, the created LendingMarket and LendingMarketOwnerCap are returned but not registered—could this lead to orphaned markets that aren't tracked by the registry? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Struct: Registry] [Table Integrity] Since lending_markets table (line 18) maps TypeName to ID but there's no reverse mapping or deletion mechanism, if a LendingMarket is destroyed, could the stale ID remain in the table causing lookup failures or preventing recreation? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [ID Mismatch] If object::id(&lending_market) at line 38 returns a different ID than expected due to object wrapping or dynamic field manipulation, could the registry track an incorrect ID preventing proper market lookup? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Unrestricted Creation] Since create_lending_market is a public function with no caller restrictions (line 31), can any user create unlimited LendingMarket instances for any type P, potentially exhausting table storage or causing registry bloat DoS? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Owner Cap Distribution] Since the function returns LendingMarketOwnerCap<P> to the caller (line 39), can the first caller to create a market for type P gain permanent admin privileges over that market type, potentially front-running legitimate market creators? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: init()] [Shared Object] Since Registry is shared via transfer::share_object at line 28, can malicious actors race to call create_lending_market immediately after init to claim ownership of critical market types before protocol deployment is complete? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [No Admin Cap] Since there's no RegistryOwnerCap or admin capability checking who can create markets, could this allow unauthorized market creation for protocol-reserved types or test types in production? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Struct: Registry] [Shared Mutable State] Since Registry is a shared object (line 28) with a mutable lending_markets table, can concurrent create_lending_market calls cause race conditions in table state despite Sui's transaction ordering? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Generic Type Squatting] Since type parameter P has no trait bounds (line 31), can an attacker create markets with malicious custom types (e.g., types with drop ability) that bypass intended LendingMarket invariants? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Type Name Spoofing] If type_name::get<P>() at line 38 can be influenced by module name manipulation or package aliasing, could an attacker create a spoofed market that collides with a legitimate protocol market type? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Phantom Type] If P is a phantom type parameter in LendingMarket<P>, could the same underlying market be registered multiple times under different phantom type instantiations causing registry inconsistency? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Type Erasure] Since TypeName from type_name::get<P>() is used as the map key (line 38), if Move's type erasure causes different generic instantiations to collapse to the same TypeName, could this prevent creation of distinct markets? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Cross-Package Types] If P is a type from an unverified or malicious package, could creating a LendingMarket<P> introduce security risks through P's module code executing during market operations? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Struct: Registry] [Table Growth] Since the lending_markets Table (line 18) grows unboundedly with each create_lending_market call and there's no deletion mechanism, could an attacker exhaust storage by creating markets for thousands of unique types? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Gas Exhaustion] If table::add operations become expensive as the table grows large (line 38), could an attacker bloat the registry table to make future create_lending_market calls prohibitively expensive for legitimate users? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Type Enumeration DoS] Could an attacker systematically create markets for all possible type combinations (e.g., generic types with many parameters) to lock out specific types needed by the protocol? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: init()] [Single Registry] Since init creates only one shared Registry object (line 21-28), if the registry becomes corrupted or reaches capacity, is there a recovery mechanism or can the protocol create a new registry? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Struct: Registry] [UID Storage] Since Registry stores a UID (line 16) and a Table (line 18), could repeated create_lending_market calls exhaust the object storage associated with the Registry's UID? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/lending_market_registry.move] [Function: create_lending_market()] [Atomicity Break] Since lending_market::create_lending_market (line 37) and table::add (line 38) are separate calls, if the transaction aborts after market creation but before table insertion, could this violate the invariant that all markets are registered? (High)"
]