[
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [All Functions] [Stub Implementation] If this is intended as stub to be replaced before mainnet but is accidentally deployed as-is, can all vault operations depending on signed math be permanently broken? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [All Functions] [Test Mocking] If this module is test-only mock that shouldn't be in production build but build configuration error includes it, can production vault use non-functional math? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test Functions] [Test Execution] Tests validate expected behavior - but if tests are never run or test environment differs from production, can implementation bugs go undetected? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test: Line 194] [Wrapping Edge] Test validates wrapping_add(MAX, 1) wraps to MIN - if vault relies on this wrapping behavior for range cycling and implementation is wrong, can cyclic calculations break? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test: Line 248] [Subtraction Edge] Test shows sub(MAX, neg(-1)) wraps to neg(MIN) - if vault uses this pattern for calculating deltas and implementation differs, can delta calculations be wrong? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test: Line 297] [Multiplication Edge] Test shows mul(MIN/2, neg(2)) returns neg(MIN) - if vault multiplies positions by negative factors and this edge case fails, can position sizing be wrong? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test: Line 315] [Division Edge] Test shows div(neg(MIN), 1) returns MIN unchanged - if vault divides minimum loss and expects positive result, can sign preservation cause confusion? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Test: Line 357] [Shift Edge] Test shows shr(neg(MIN), 63) returns -1 (all bits set) - if vault expects zero from maximum shift and gets -1, can this break shift-based scaling? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Function: add()] [Vault PnL Overflow] If vault accumulates profits using add() and profit exceeds MAX_AS_U64, does add() abort preventing vault from accepting more profit, or does it overflow creating accounting error? If aborts, can attacker intentionally push vault to MAX profit then DoS future deposits? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i64.move] [Function: sub()] [Vault Loss Underflow] If vault tracks cumulative losses using sub() and losses exceed MIN_AS_U64 magnitude, does sub() abort preventing loss recording, or underflow wrapping to positive? If abort, can attacker intentionally push vault to MAX loss then DoS loss recording? (High)"
]