[
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: type_y] [Type Reversal Attack] Can an attacker create a Pool<X,Y> where type_x and type_y are intentionally swapped, causing external integrations to incorrectly interpret which reserve corresponds to which token? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: type_x()] [TypeName Consistency] Does type_x() always return the same TypeName that was set at initialization, or can it be manipulated to return a different type, breaking external protocol integrations? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: type_y()] [Type Getter Manipulation] If type_y() can be overridden or shadowed by a malicious module, can attackers trick external protocols into interacting with the wrong pool or token type? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: initialize()] [Missing Authorization Check] Does initialize() require an admin capability or pool creator capability, or can any user call initialize() on any Pool object, allowing unauthorized initialization or re-initialization? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Event: PoolPausedEvent] [Pause Bypass] If PoolPausedEvent is emitted but the pool state doesn't enforce the pause flag, can swaps and liquidity operations continue while the pool is supposedly paused, violating emergency shutdown procedures? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Event: ToggleTradingEvent] [Trading Toggle Race] If ToggleTradingEvent indicates trading is disabled but the toggle is not applied atomically, can attackers front-run the toggle to execute swaps that should be blocked? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: transfer()] [Unauthorized Pool Transfer] Does transfer() check that the caller has appropriate authority before sharing/transferring the Pool object, or can any address call transfer() to take control of pool administration? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: flash_loan_fee_rate] [Flash Loan Reentrancy] If flash loan callbacks don't include reentrancy guards, can an attacker take a flash loan, recursively call the flash loan function again in the callback, and compound borrows to extract more than available reserves? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: reserve_x] [Flash Loan Reserve Depletion] If flash loans withdraw from reserve_x without checking that reserve_x.value() >= borrowed_amount + fee, can the pool become insolvent if the borrower doesn't repay? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: protocol_flash_loan_fee_share] [Flash Loan Fee Theft] Can an attacker manipulate protocol_flash_loan_fee_share to redirect flash loan fees to themselves instead of the protocol, extracting protocol revenue? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: reserve_y] [Flash Loan Cross-Reserve Attack] If a flash loan borrows reserve_x but repayment is validated against reserve_y balance, can an attacker repay with the wrong token and still pass the repayment check? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: liquidity] [Global Liquidity Bypass] When minting positions, if position liquidity is added to ticks but not properly aggregated into pool.liquidity, can the global liquidity diverge from sum of active position liquidities, breaking swap calculations? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: liquidity] [Liquidity Sandwich Attack] Can an attacker observe a pending large liquidity addition, front-run with a swap to move the price, mint their position after the liquidity is added at favorable terms, then back-run to restore the price and extract value? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: max_liquidity_per_tick()] [Liquidity Cap Query Manipulation] If max_liquidity_per_tick() returns a cached or outdated value, can position minting logic make incorrect decisions about whether to allow a new position, bypassing liquidity caps? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: liquidity()] [Liquidity Getter Inconsistency] Does liquidity() return the actual current pool.liquidity after accounting for cross-tick updates, or can it return a stale value during multi-tick swaps, causing incorrect slippage calculations? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: sqrt_price()] [Price Snapshot Attack] If sqrt_price() can be read during a swap before sqrt_price is updated, can an attacker use the stale price to calculate favorable swap amounts in a separate transaction? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: tick_index_current()] [Tick Index Inconsistency] Does tick_index_current() always match the tick_index derived from current sqrt_price, or can they diverge, causing position crossing logic to malfunction? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: tick_spacing()] [Spacing Immutability Violation] If tick_spacing() returns a value that differs from pool.tick_spacing due to external manipulation, can this cause position validation to accept invalid tick ranges? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: get_friendly_ticks()] [Sqrt Price to Tick Conversion Error] If get_friendly_ticks() uses a different sqrt_price to tick conversion formula than the swap logic, can positions be created at ticks that are never actually crossed by swaps, resulting in unused liquidity? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: sqrt_price] [Price Impact Bypass] If swaps don't check that the price impact (final_sqrt_price - initial_sqrt_price) is within acceptable bounds, can an attacker perform a swap that moves the price by more than the intended slippage tolerance? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: reserve_x] [Swap Reserve Underflow] During a swap that outputs token X, if reserve_x is decremented before validating that reserve_x >= amount_out, can the reserve underflow and allow the attacker to extract more tokens than available? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: fee_growth_global_x] [Swap Fee Distribution Timing] If fee_growth_global_x is updated after reserves are modified but before liquidity is updated, can there be a window where fees are distributed to incorrect liquidity amounts? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Struct Field: swap_fee_rate] [Zero Fee Swap] If swap_fee_rate can be set to zero by the pool creator, can this be used to attract volume at the expense of LPs, effectively allowing the creator to extract value by routing their own trades through the pool? (Medium)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: protocol_fee_x()] [Fee Collection Without Validation] If protocol fees are collected by withdrawing protocol_fee_x amount from reserve_x without checking reserve_x.value() >= protocol_fee_x, can this cause reserve underflow? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/pool.move] [Function: protocol_fee_y()] [Concurrent Fee Collection] If protocol_fee_y is collected simultaneously from multiple transactions, can race conditions cause more fees to be withdrawn than accumulated, depleting reserves? (High)"
]