[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Integration: Decimal Standards] The adaptor converts prices to arbitrary target_decimal values - is there consistency across the protocol about which decimal standard to use (9 vs 18), or could mixed decimals cause 10^9 pricing errors? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Module: adaptor_supra] [Function Visibility] Should get_price_native() be public, or should it be internal-only with get_price_to_target_decimal() being the only public interface? Could exposing the raw interface enable attacks? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Integration: Multi-Oracle Setup] If the protocol uses multiple oracle providers (Supra and Pyth), could an attacker exploit price discrepancies between providers by choosing which oracle to query for maximum profit? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Module: adaptor_supra] [Documentation] There is minimal documentation - could developers misunderstand the expected decimal format or pair_id encoding, leading to integration bugs that cause systematic mispricing? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Function: get_price_to_target_decimal()] [Decimal Conversion Loop] The underlying to_target_decimal_value_safe() uses a while loop - if the decimal difference is large, could the gas cost become prohibitive, causing transaction failures during high-volatility periods when price updates are most critical? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Function: get_price_to_target_decimal()] [Zero Price Handling] to_target_decimal_value_safe() has special handling for value=0 to prevent stack overflow - but returning 0 price without error could enable exploitation of zero-price states to drain assets. Should this be treated as an error instead? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Function: get_price_to_target_decimal()] [Multiplication Overflow] When scaling up decimals, to_target_decimal_value_safe() multiplies by 10 repeatedly - could a large initial price with significant decimal scaling cause the value to exceed u256::MAX, wrapping around to a small value? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Function: get_price_to_target_decimal()] [Precision Loss Accumulation] When scaling down decimals through repeated division by 10, each division truncates - could this cumulative precision loss be exploited through carefully timed operations that maximize rounding errors? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Function: get_price_to_target_decimal()] [Type Safety] The conversion from u16 decimal to u64 decimal and u8 target_decimal to u64 - are there any edge cases where the type conversions could cause unexpected behavior in the comparison logic? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Oracle Manipulation] Could an attacker who gains temporary control of a Supra oracle validator submit a malicious price update (e.g., 1000x inflated price), and would this adaptor accept it without bounds checking, allowing the attacker to borrow excessive amounts against inflated collateral? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Stale Price Exploitation] If the Supra oracle fails to update prices during a market crash, would this adaptor continue using stale prices, allowing attackers to deposit crashing assets at inflated historical prices before the oracle updates? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Decimal Confusion] Could an attacker exploit confusion between decimal formats by depositing assets priced in one decimal format but withdrawing based on a different decimal format, creating a 10^9 arbitrage opportunity? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Pair ID Substitution] Could an attacker who compromises the oracle admin credentials change pair_id mappings to point a stable asset to a volatile asset's price feed, causing the protocol to accept deposits at inflated valuations? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Zero Price Attack] If the Supra oracle returns price=0 due to a bug or manipulation, would the adaptor accept this, allowing an attacker to withdraw all assets valued at zero price? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Timestamp Manipulation] Could an attacker who controls oracle updates set timestamps far in the future, causing the protocol to accept these prices indefinitely until real time catches up? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Overflow Exploitation] Could an attacker trigger overflow in decimal conversion by configuring an asset with price=u128::MAX and decimal=1, then requesting target_decimal=18, causing the price to wrap around to near-zero? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Flash Loan Oracle Manipulation] Could an attacker use flash loans to manipulate the Supra oracle's price for one block, execute vault operations at the manipulated price, then have the oracle revert, leaving the vault with permanently incorrect positions? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Cross-Oracle Arbitrage] If the protocol uses both Supra and Pyth, could an attacker exploit temporary price divergence by depositing via the higher-priced oracle and withdrawing via the lower-priced oracle? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Attack Scenario: Precision Loss Grinding] Could an attacker repeatedly perform small operations that maximize rounding errors in decimal conversion, gradually siphoning value through accumulated precision loss? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Pair ID Configuration] When oracle_manage::create_supra_oracle_provider_config() is called, are there sufficient validation checks that the pair_id actually exists in Supra oracle and corresponds to the intended asset? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Target Decimal Configuration] Is target_decimal standardized across the protocol, or could different modules use different target decimals for the same asset, causing valuation inconsistencies? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Oracle Holder Management] How is the OracleHolder object created and who controls it? Could a malicious actor create a fake OracleHolder and pass it to these functions? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Admin Privilege Abuse] Could a malicious or compromised oracle admin use oracle_manage functions to misconfigure pair IDs, directing price feeds to wrong assets and enabling theft? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Emergency Response] If the Supra oracle is compromised or malfunctions, is there an emergency mechanism to disable this adaptor and switch to alternative price sources without losing vault funds? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_supra.move] [Governance: Upgrade Path] If the adaptor needs to be upgraded due to a critical bug, can it be upgraded without disrupting existing vault operations and price feeds? (Medium)"
]