[
  "[File: volo-vault/sources/utils.move] [Function: parse_key()] [Type Confusion] Can an attacker exploit type name collisions by creating two different types that produce identical AsciiString keys when combined with the same idx, allowing unauthorized asset access or type confusion in vault asset tracking? (High)",
  "[File: volo-vault/sources/utils.move] [Function: parse_key()] [Input Validation] Can idx parameter accept values 0-255 without validation, potentially causing key collision when idx wraps around or conflicts with hardcoded indices in adaptor logic? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: parse_key()] [String Conversion] Can malformed type names containing special characters break the string concatenation in parse_key(), causing runtime errors or unexpected key generation for DeFi asset tracking? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: parse_key()] [Key Uniqueness] If multiple adaptors use the same type T with overlapping idx ranges, can this create asset ID collisions in vault's asset tracking, allowing one adaptor to corrupt another's state? (High)",
  "[File: volo-vault/sources/utils.move] [Function: parse_key()] [Denial of Service] Can an attacker force extremely long type names to cause string concatenation to exceed memory limits, creating DoS when vault attempts to parse asset keys during operations? (Low)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Arithmetic Overflow] Can v1 * v2 overflow u256 max before division by DECIMALS (1e9), causing transaction abort and DoS in share calculation or fee computation paths? (Critical)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Precision Loss] Can the multiplication followed by division lose precision for small values, causing share accounting errors where users receive fewer shares than expected when depositing small amounts? (High)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Rounding Down] Does mul_d() always round down due to integer division, and can attackers exploit this to repeatedly perform operations that accumulate rounding errors, draining vault value over time? (High)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Zero Input] If v1 or v2 is zero, does mul_d() return zero correctly, or can this be exploited in scenarios where zero multiplication should be prevented (e.g., fee calculations)? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Associativity] Can the order of operations matter when mul_d() is chained multiple times, causing different results due to intermediate rounding and violating accounting invariants? (High)",
  "[File: volo-vault/sources/utils.move] [Function: mul_d()] [Extreme Values] Can passing values near u256::MAX to mul_d() cause overflow before the division, even if the final result would fit in u256, leading to unexpected reverts in vault operations? (High)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Division by Zero] Can v2 be zero, causing division by zero panic and complete DoS of vault operations that rely on div_d() for share/asset conversions? (Critical)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Arithmetic Overflow] Can v1 * DECIMALS overflow u256 max when v1 is large, causing transaction abort even when the final division result would be valid? (Critical)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Precision Loss] For v1 < v2, does div_d() return a value less than DECIMALS, and can this cause precision loss where small ratios round down to zero, breaking share calculations? (High)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Rounding Down] Does integer division in div_d() always round down, allowing attackers to exploit this in withdraw calculations to receive more assets than their share entitles? (High)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Inverse Operations] Are mul_d() and div_d() true inverses, or can chaining them introduce accumulated rounding errors that break share/asset conversion invariants? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: div_d()] [Extreme Ratios] When v1 is extremely small and v2 is extremely large, can div_d() return zero incorrectly, causing users to lose value in withdrawal calculations? (High)",
  "[File: volo-vault/sources/utils.move] [Function: to_decimals()] [Arithmetic Overflow] Can v * DECIMALS overflow u256 max when converting raw amounts to decimal representation, causing DoS in deposit or value calculation paths? (High)",
  "[File: volo-vault/sources/utils.move] [Function: to_decimals()] [Input Validation] Is there validation that v is within safe range before multiplication, or can passing values > u256::MAX / DECIMALS cause overflow? (High)",
  "[File: volo-vault/sources/utils.move] [Function: to_decimals()] [Reversibility] Can to_decimals() and from_decimals() be safely chained without loss of precision, or do edge cases exist where original value cannot be recovered? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: from_decimals()] [Precision Loss] Does from_decimals() truncate fractional parts through integer division, and can this cause loss of user funds when converting shares back to assets? (High)",
  "[File: volo-vault/sources/utils.move] [Function: from_decimals()] [Zero Result] For v < DECIMALS, does from_decimals() return zero, and can attackers exploit this to make small deposits/withdrawals that round down to zero, stealing value? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: from_decimals()] [Rounding Attack] Can attackers repeatedly deposit and withdraw amounts just below DECIMALS threshold to exploit rounding errors and extract value from the vault? (Medium)",
  "[File: volo-vault/sources/utils.move] [Function: to_oracle_price_decimals()] [Arithmetic Overflow] Can v * ORACLE_DECIMALS (1e18) overflow u256 when converting prices, causing DoS in oracle price operations or valuation calculations? (Critical)",
  "[File: volo-vault/sources/utils.move] [Function: to_oracle_price_decimals()] [Decimal Mismatch] Can confusion between DECIMALS (1e9) and ORACLE_DECIMALS (1e18) in price conversions cause 1 billion-fold errors in asset valuations? (Critical)"
]