[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: add_internal()] [No Overflow Check] The add_internal() function at lines 134-136 performs unchecked addition. If this is the basis for all positive addition, can any scenario where two large Decimals are added (e.g., aggregating vault TVL across multiple operations) silently overflow? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: sub_internal()] [No Underflow Check] While sub_internal() at lines 138-144 handles the case where b > a by returning negative result, it doesn't check for overflow when computing b.value - a.value at line 140. Can subtraction of similar large values cause unexpected behavior? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: add()] [Epoch Rollover Accumulation] If vault accrues rewards or fees each epoch by adding Decimal amounts at lines 71-89, and this happens over 1000s of epochs, can accumulated rounding errors or overflow cause total accrued value to diverge significantly from expected? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: scale_to_decimals()] [Price Staleness Amplification] If an oracle price becomes stale and is scaled multiple times using scale_to_decimals() before being detected, can the scaling operations amplify any initial error, making stale price detection harder and allowing vault to use bad prices? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: sub()] [Withdrawal Amount Validation] When computing available withdrawal amount as (user_shares * vault_value / total_shares) using sub() operations at lines 95-111, can negative intermediate results cause the withdrawal to be computed as larger than user's actual balance? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: add()] [Deposit Share Minting] When minting shares for deposits as (deposit_amount / share_price) computed via add() operations at lines 71-89, can overflow or precision loss cause attacker to receive more shares than they should, diluting other users? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: scale_to_decimals()] [Cross-Asset Deposit Conversion] If vault accepts deposits in multiple assets (SUI, USDC, etc.) with different decimals, and normalizes them via scale_to_decimals(), can precision loss in conversion cause unfair share distribution favoring certain asset types? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: add_mut()] [Fee Collection Manipulation] If operators collect fees by using add_mut() to increment their fee balance at line 91-93, and this happens during an ongoing vault operation, can the mutation interfere with operation's value calculations, causing incorrect fee collection? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/decimal.move] [Function: sub_mut()] [Emergency Withdrawal] If admin performs emergency withdrawal by using sub_mut() to decrement vault balances at lines 113-115, can the mutation cause intermediate inconsistent state visible to concurrent users, enabling front-running attacks? (Medium)"
]