[
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [MEV] Can an attacker who controls pause timing manipulate LST/SUI price on DEXs by pausing immediately after large stake events, creating arbitrage opportunities? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Market Impact] If version check causes widespread transaction failures during upgrade, can this crash LST price due to perceived protocol failure, enabling market manipulation? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [V1 to V2] During volo_v1 to v2 migration, is set_paused() called correctly in sequence, or can import_stakes() execute with paused=false permanently, bypassing intended safety checks? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Export/Import Race] Can an attacker stake between export_stakes() and import_stakes(), and does this create duplicate LST minting since new stakes aren't included in migration accounting? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Migration Window] The 172-175 pause toggles in migrate.move - can an attacker monitor chain state and inject malicious transactions precisely during unpause window? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Migration Incomplete] If migration partially completes (some stakes imported but not all), does check_version() still pass, allowing operations on incomplete state that violate ratio invariants? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Admin Only] Is migrate_version() truly gated by AdminCap in all call paths, or can OperatorCap holder trigger migration via alternate entry points? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Operator Override] Can OperatorCap holder effectively bypass pause by calling operator-gated functions like rebalance() that don't check_not_paused()? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: new()] [Cap Creation] When StakePool is created with new Manage, are AdminCap and OperatorCap properly initialized, or can pool exist without caps, making it ungovernable? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Version Overflow] Although version is u64, if VERSION constant somehow overflows in distant future, does <= comparison still work correctly or can it wrap around? (Low)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Comparison Logic] Is == comparison sufficient, or should it be self.version >= VERSION to allow forward compatibility with future client versions? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Missing Event] Does migrate_version() emit an event, and if not, can off-chain systems miss critical version upgrades and operate on stale protocol assumptions? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Silent Failure] When version check fails, does it provide enough context in error to distinguish between which version was expected vs found for debugging? (Low)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Event Spam] If attacker repeatedly calls functions that fail on check_not_paused(), can they spam events/logs to mask real security incidents? (Low)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Gas Waste] Does every stake/unstake incur unnecessary gas for version check when version hasn't changed in months, and can this be optimized without compromising security? (Low)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [High Gas] If StakePool has massive validator_pool or extra_fields bag, does migration consume excessive gas, potentially causing transaction to fail and leaving protocol stuck? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Struct: Manage] [Storage] With only `store` ability, is Manage properly encapsulated within StakePool, or can it be extracted and manipulated via sui::dynamic_field operations? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: new()] [Bag Storage] StakePool has extra_fields bag - can malicious code store fake Manage struct in bag and bypass real manage field checks? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Bridge] If LST tokens are bridged to another chain, can bridged tokens be minted on chains that don't enforce version checks, creating unbacked supply? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Bridge Pause] If Sui chain is paused but bridge operates on stale state, can users mint LST on other chains while Sui-side pool is frozen? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Breaking Change] If VERSION 3 introduces breaking changes to StakePool layout, does migrate_version() handle data migration or just increment version number, corrupting existing fields? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Backwards Compat] Can old client code (expecting VERSION 1) still read StakePool data after migration to VERSION 2, or does version mismatch cause read failures? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Constants: VERSION] [Upgrade Path] Is there a documented upgrade path from VERSION 2 to 3, or can admin arbitrarily increment VERSION without proper migration code? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Validator Exit] If a validator exits network while pool is paused, can users' delegated stakes be lost since rebalance() to rescue stakes may also be paused? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Slashing] If validators get slashed during pause period, do users bear the loss proportionally, and can admin pause strategically to avoid their own exposure? (Medium)"
]