[
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Overflow Detection Bypass] Can an attacker cause integer overflow by passing a=u256::MAX and b=1, where the addition wraps to 0, but the assertion c >= a would pass (0 >= u256::MAX is false), properly catching the overflow? Verify assertion logic handles MAX boundary. (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Assertion Bypass] If a=u256::MAX-1 and b=2, does c=u256::MAX+1 wrap to 0 in Move's u256 arithmetic before the assertion check, allowing overflow to pass undetected? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Share Inflation] When calculating total shares in vault deposit requests using add(), can an attacker deposit maximum values repeatedly to cause accumulated overflow that inflates their share proportion beyond deposited amount? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Fee Accumulation] When adding boosted balance fees across multiple epochs, can accumulated fees overflow u256 limit causing fee collection to abort and lock rewards permanently? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Oracle Price Aggregation] When aggregating multiple oracle prices using add() for total_usd_value calculation, can strategically timed large price feeds cause overflow that aborts operations during critical vault rebalancing? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Request Buffer Overflow] When adding pending deposit amounts in request buffers, can an attacker submit multiple max-value deposits to overflow buffer accounting and corrupt withdrawal queue? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Validator Weight Sum] When summing validator weights across all validators in liquid staking pool, can overflow in total weight calculation cause incorrect delegation proportions? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Loss Tolerance Bypass] Can an attacker cause overflow when adding loss_tolerance values across multiple operations to bypass per-epoch loss limits? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Gas Griefing] Can an attacker repeatedly trigger add() with values near MAX to cause assertion failures that consume gas and DoS vault operations? (Low)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Reward Accrual] When adding epoch rewards to boosted balances, can overflow cause reward distribution to fail and lock user funds indefinitely? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Multi-Asset Value Sum] When calculating total vault value across multiple DeFi positions (Navi, Suilend, Cetus, Momentum), can adding asset values overflow and report incorrect total_usd_value? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Fee BPS Accumulation] When adding multiple fee basis points (protocol fee + performance fee + management fee), can overflow cause fees to wrap to zero and allow fee-free operations? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Migration Balance Transfer] During volo_v1 to v2 migration, can adding old and new balance values overflow and corrupt migrated balances? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Adaptor Asset Return] When adding returned asset amounts from multiple adaptors, can overflow cause asset accounting mismatch and allow theft? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Health Factor Calculation] In Navi limiter health factor computation, can adding collateral values overflow and falsely pass health checks? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Underflow Attack] Can an attacker pass a=0 and b=1 to cause underflow that wraps to u256::MAX, and does the assertion b <= a properly catch this before subtraction? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Assertion Order] Is checking b <= a before subtraction sufficient, or can concurrent operations between assertion and subtraction cause race condition leading to underflow? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Share Burn Underflow] When burning shares during withdrawal, can an attacker provide withdrawal amount larger than their shares to underflow share accounting and steal other users' funds? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Fee Deduction Underflow] When deducting fees from deposit amounts, can zero or negative balance cause underflow that wraps to huge positive value, inflating shares? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Validator Unstake] When calculating unstake amount by subtracting from staked balance, can providing amount > staked cause underflow that corrupts validator pool accounting? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Loss Calculation] When subtracting current value from previous total_usd_value snapshot to calculate losses, can underflow occur if value increases and variables are reversed? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Request Cancellation] When canceling deposit request and subtracting from buffer, can underflow corrupt request queue if amount was already partially processed? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Oracle Price Delta] When calculating price change delta using sub(), can underflow occur in volatile market causing operations to abort? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Adaptor Borrow Tracking] When subtracting returned assets from borrowed amount tracking, can underflow allow returning less than borrowed? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Locking Window] When subtracting timestamps to check locking window elapsed, can underflow due to clock skew bypass withdrawal locks? (Medium)"
]