[
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Edge Case: Reserve Migration] If reserve ID is being migrated/deprecated, could getter return old configuration while new transactions use new configuration causing temporal inconsistency in vault decisions? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Edge Case: Oracle ID Reuse] If oracle_id is reused for different asset after reserve removal, could historical queries return wrong prices for assets that previously used same ID? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Edge Case: Clock Time Backwards] If Clock timestamp goes backwards (due to chain reorg or bug), could oracle prices become invalid or rates be calculated incorrectly based on negative time delta? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Edge Case: Decimal Overflow] If asset has decimals=255 (u8 max) and price calculations multiply by 10^decimals, could overflow occur immediately making asset unpriceable? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Loop Index Manipulation] All three functions use while(length > 0) with length-1 indexing - could precision loss or underflow in index calculations cause off-by-one errors skipping first reserve/oracle? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Vector Growth] Functions use vector::push_back in loop without size limit - could attacker force excessive vector growth causing memory exhaustion or hitting transaction size limits? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Reference Aliasing] Functions borrow from vectors while in loops - could this cause undefined behavior if storage module internally modifies vectors during iteration? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Type Confusion] Functions return structs with u256 fields but no units - could callers misinterpret field meanings (e.g., confusing rates with ratios, or raw balances with scaled balances)? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Information Leakage] Public functions expose all user positions and reserve configurations - could MEV bots use this to front-run liquidations, rate changes, or large user operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Gas Griefing] Functions have no gas limits on iteration - could attacker create scenario forcing caller to run out of gas by maximizing reserve count or user position count? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Timestamp Manipulation] Functions rely on Clock but don't verify timestamp is recent - could stale timestamps (hours old) be accepted leading to using outdated price/rate data? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: No Duplicate Check] get_oracle_info() doesn't check for duplicate IDs in input vector - could duplicate queries return inconsistent data if oracle state changes between duplicate checks? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Reverse Iteration] Loop iterates backwards from length-1 to 0 - is this intentional? Could forward iteration be safer to avoid underflow edge cases? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Vulnerability: Mutable Borrow Misuse] Functions take &mut Storage but appear read-only - could this enable unintended state mutations through seemingly safe getter calls? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Rate Update Frequency] If protocol updates rates only on user actions but getter returns current rate, could periods of no activity lead to severely outdated rates enabling arbitrage? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Index Precision] If protocol uses different precision for internal calculations vs getter returns, could rounding differences accumulate to significant value over time? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Cap Enforcement] Getter returns caps but doesn't enforce them - could race condition exist where cap is checked via getter but exceeded before actual operation due to concurrent transactions? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Oracle Freshness] No timestamp comparison for oracle price age - could protocol accept prices hours/days old in low-volatility assets that suddenly move, enabling liquidation attacks? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Config Versioning] Functions return current config but don't include version number - could callers use outdated config expectations after protocol upgrades causing operation failures? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Partial Liquidation] Getter returns full user state but doesn't indicate liquidation eligibility - could this cause liquidators to waste gas attempting non-liquidatable positions? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Flash Loan Impact] If protocol allows flash loans, could getter be called mid-flash-loan returning temporarily inflated balances that don't represent real state? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Multi-Call Atomicity] Functions make multiple storage calls - if storage uses check-effect-interaction pattern, could reentrancy between calls return inconsistent snapshot? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Reserve Pause State] Getter doesn't return pause status per reserve - could callers attempt operations on paused reserves wasting gas or getting unexpected reverts? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Protocol: Whitelisting] No indication if reserves require whitelist - could callers assume open access when reserve requires specific capabilities causing operation failures? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Oracle Sandwich] Attacker queries oracle before/after their price manipulation transaction - could they use getter to verify price impact before committing to exploit? (High)"
]