[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Transaction Atomicity] The actuate() function performs multiple operations (read old value, set new value, emit event). If the transaction fails partway through due to gas exhaustion or assertion failures, can the State object be left in an inconsistent state? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Package Visibility Bypass] The actuate() function calls on_demand::set_guardian_queue_id, which has 'public(package)' visibility. Since this action module is in the same package, it can call it, but does this violate the principle of least privilege by allowing action modules to directly mutate critical state without additional checks? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Cross-Module State Consistency] The run() function modifies State but doesn't check if the new guardian_queue_id is compatible with other State fields (oracle_queue, on_demand_package_id). Can setting an incompatible guardian queue break the relationship between these components and cause oracle feed failures? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [Missing Dependency Checks] The module imports on_demand but doesn't verify version compatibility or module address consistency. In an upgrade scenario, can an old action module interact with a new State structure incorrectly after a protocol upgrade? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Guardian Queue Capabilities] The actuate() function doesn't verify that the new guardian queue has the necessary capabilities or permissions to actually validate oracle updates. Can setting a guardian queue without proper oracle validation capabilities result in unvalidated or incorrectly validated price feeds? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Active Operations Check] The run() function doesn't check if there are active oracle operations or pending guardian validations. Can changing the guardian queue mid-operation cause in-flight oracle updates to be validated against the wrong guardian queue, leading to price data inconsistencies? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Migration Path] The run() function provides no migration or transition logic when changing guardian queues. If Queue A is replaced with Queue B, how are pending validations from Queue A handled, and can this create a gap where oracle updates are neither validated by the old nor the new guardian queue? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Deprecation Flag] The actuate() function doesn't mark the old guardian queue as deprecated or notify it of being replaced. Can the old guardian queue continue accepting and processing validation requests after being replaced, leading to conflicting validation states? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Oracle Queue Impact Analysis] The run() function doesn't check how many oracle queues depend on the current guardian queue. Can changing the guardian queue break existing oracle feeds that are configured to use specific guardian validation logic, causing price feed failures across the entire protocol? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Emergency Mode] The run() function has no emergency or maintenance mode flag. In a security incident where the guardian queue is compromised, can the admin quickly set a backup guardian queue, or could there be delays/failures in emergency guardian queue rotation? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Single Point of Failure] The run() function allows a single AdminCap holder to change the guardian queue without any backup or redundancy mechanisms. If the admin key is lost or the admin is unavailable during a security incident, can the guardian queue be changed at all, creating a single point of failure? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Previous Values History] The actuate() function only emits the immediate previous guardian_queue_id in the event, with no history tracking. In case of multiple rapid changes (legitimate or attack), how can the system revert to a known-good guardian queue without complete event history analysis? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Gas Optimization] The run() function doesn't check if the new guardian_queue_id is the same as the current one before calling actuate(). Can an attacker or malfunctioning admin script repeatedly set the same guardian queue, wasting gas and spamming events without actually changing any state? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Redundant State Read] The actuate() function calls state.guardian_queue() to get the old value right before changing it. Could this redundant read be optimized, or in a high-contention scenario, could there be a TOCTOU (Time-Of-Check-Time-Of-Use) issue if the state is modified between the read and the set? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: validate()] [Dead Code] The validate() function is defined but completely empty, suggesting incomplete implementation. Is this function planned to be implemented in the future, and could the current deployment be vulnerable due to missing validation logic that was intended but never completed? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: validate()] [Misleading Function Name] The validate() function name suggests it performs validation, but it's empty. Can this mislead developers or auditors into assuming validation exists when it doesn't, creating a false sense of security? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [Missing Natspec] The module has no documentation comments explaining the security model, preconditions, or invariants that should be maintained. Can this lead to misuse by integrators or future developers who don't understand the critical security implications of guardian queue changes? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Oracle Price Manipulation Risk] The run() function allows immediate guardian queue changes without any price feed freeze or cooldown period. Can an attacker who compromises the AdminCap switch to a malicious guardian queue and then immediately push through manipulated oracle price updates before monitoring systems detect the change? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Guardian Signature Continuity] The actuate() function doesn't address how guardian signatures from the old queue are handled after the switch. If oracle updates were signed by the old guardian queue but submitted after the guardian queue change, will they be accepted or rejected, and can this create oracle feed gaps or replay attack vectors? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Oracle Feed Impact Assessment] The run() function doesn't check or notify oracle feed consumers (like Volo Vault) that the guardian queue is changing. Can DeFi protocols relying on these oracle prices be caught off-guard by guardian queue changes, leading to incorrect valuations during the transition? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Guardian Queue Authority Transfer] The actuate() function doesn't verify that the new guardian queue has proper authority and trust setup. Can an admin accidentally set a guardian queue that doesn't have the cryptographic keys or infrastructure needed to validate oracle updates, causing all oracle operations to fail? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Struct: GuardianQueueIdSet] [Type Confusion] The GuardianQueueIdSet event uses generic ID type for both old and new guardian_queue_id without type-level guarantees that they refer to Queue objects. Can type confusion lead to setting non-Queue object IDs as the guardian queue? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Parameter Type Safety] The run() function accepts a raw ID type for guardian_queue_id instead of a typed reference like &Queue. Does this lack of type safety allow passing IDs of wrong object types that will cause runtime failures in guardian validation logic? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [No Builder Pattern] The module uses a direct action execution pattern without any builder or staged approval mechanism. For such a critical operation, should there be a two-phase commit (propose guardian queue change, then execute after review period) to prevent hasty or erroneous changes? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Volo Vault Price Impact] The run() function changes the guardian queue without coordinating with Volo Vault's oracle price configuration. Can this cause Volo Vault to receive oracle prices validated by an unexpected guardian queue, leading to incorrect asset valuations and potential loss tolerance bypass? (Critical)"
]