[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_identifier_to_vector()] [Identifier Stability] If Pyth changes price identifier format or values across upgrades, can existing vault mappings break, causing wrong asset pricing or DoS of affected assets? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_to_target_decimal()] [Maximum Decimal] If target_decimal approaches u8::MAX (255), 10^255 exceeds u256 capacity. Does to_target_decimal_value_safe() handle this, or can it panic/overflow causing DoS of high-decimal-target operations? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_to_target_decimal()] [Expo Decimal Mismatch] If expo=18 and target_decimal=6, conversion divides by 10^12. For prices with expo=18 representing sub-cent values, can division cause mass precision loss, rounding many assets to zero? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_unsafe_to_target_decimal()] [Consistent Rounding] If to_target_decimal_value_safe() rounds down and vault calculations expect round-nearest, can systematic rounding bias accumulate to enable slow drain attacks via repeated operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_to_target_decimal()] [Decimal Cross-Asset] If different assets use different target_decimal values (e.g., SUI=9, USDC=6), can inconsistent precision across portfolio calculations cause valuation errors, enabling arbitrage between high/low precision assets? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_native()] [Expo Return Unused] Function returns (price, expo, timestamp) but expo is already applied in decimal functions. If caller mistakenly uses expo for additional conversions, can double conversion create massive over/under-valuations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_to_target_decimal()] [Timestamp Return Only] Returns (decimal_price, timestamp) but not expo. If caller needs to verify conversion correctness or reverse the calculation, can missing expo data cause integration errors or trust assumptions? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_native()] [Tuple Ordering] Returns (price, expo, timestamp). If caller destructures in wrong order (common in Move), can price/expo swap cause catastrophic valuation errors, treating expo values as prices? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_unsafe_to_target_decimal()] [Reduced Return Info] Only returns price and timestamp, not expo. If caller needs to audit decimal conversion or detect precision loss, can missing data hide manipulations or errors? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Import: pyth::i64] [i64 Module Trust] Relies on Pyth's i64::get_magnitude_if_positive/negative functions. If these have bugs (off-by-one, sign errors), can they propagate to vault causing wrong price extractions across all assets? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Import: pyth::price] [Price Module Trust] Uses price::get_price(), get_expo(), get_timestamp(). If Pyth price module has vulnerabilities (e.g., expo not validated), can malformed price objects bypass adaptor's assumptions? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Import: oracle_utils] [Utils Module Safety] Line 42, 50 call utils::to_target_decimal_value_safe(). If this function has overflow bugs or incorrect rounding, can it propagate to all oracle price conversions enabling systematic exploitation? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Import: pyth::state] [State Module Integrity] Queries state::get_price_info_object_id(). If Pyth state can be corrupted or attacked, can adaptor read prices from wrong feeds or malicious price info objects? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Import: pyth::price_info] [Price Info Integrity] Uses price_info::get_price_info_from_price_info_object() and related functions. If PriceInfoObject can be forged or manipulated (shared object attacks), can adaptor be tricked into reading fake prices? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Liquidation Avoidance] Attacker with under-collateralized position calls vault operation that uses get_price_unsafe_to_target_decimal(), getting stale prices showing sufficient collateral during market crash. Can they avoid liquidation by timing operations during oracle lag? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Deposit Inflation] During price spike, attacker deposits using get_price_unsafe_native() which shows old lower prices, receiving more shares than entitled. Market corrects, attacker withdraws with current prices. Can they extract the inflation delta from other depositors? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Withdrawal Deflation] During price drop, attacker withdraws using stale high prices from unsafe functions, receiving more assets than fair value of shares. Can they repeatedly exploit oracle lag during volatility to drain vault? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Fee Evasion] Vault fees calculated as percentage of USD value using oracle prices. If operator uses unsafe functions during low price periods, fees appear lower. Can they systematically under-collect fees via oracle function selection? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Health Check Bypass] Health limiter calls adaptor for collateral valuation. Attacker submits operation using get_price_unsafe_native() during price feed downtime, showing stale healthy prices while actual market is crashing. Can they over-leverage beyond safety limits? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Cross-Asset Arbitrage] Attacker identifies two correlated assets where one Pyth feed updates faster. Uses fast feed with safe function, slow feed with unsafe function. Can they arbitrage the price delta by trading in vault between the assets? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Decimal Precision Exploit] Attacker repeatedly deposits/withdraws small amounts with target_decimal conversion causing rounding. Each operation loses 1 unit due to rounding down. After 1000 operations, attacker captures accumulated dust. Is this profitable at scale? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Timestamp Overflow Trigger] Attacker waits until Pyth timestamp approaches u64::MAX/1000. Operations at that moment overflow line 19/32 multiplication, wrapping timestamp to near-zero. Downstream staleness checks see",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Price Feed DoS] Attacker finds asset with price feed returning negative price or positive expo. Operations on this asset panic. Can they force vault into this state by manipulating which price feeds are used or waiting for feed errors? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Attack: Oracle Update Censorship] Attacker front-runs Pyth price update transactions with high gas, delaying updates. Vault operations during delay use stale prices via unsafe functions. Can they profit from the staleness by executing operations beneficial to old prices? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Business Logic: Multi-Oracle Fallback] If vault uses both Pyth and Switchboard oracles with fallback logic, can an attacker deliberately cause one oracle path to fail (e.g., negative price panic) to force fallback to manipulated oracle? (High)"
]