[
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Integer Overflow] When adding two u256 values near MAX_U256, can the overflow check 'c >= a' fail to detect wrapping if the compiler optimizes the addition operation, allowing share inflation in vault accounting? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Logic Error] The overflow check 'c >= a' only verifies against 'a' but not 'b' - can this asymmetric check allow edge cases where overflow occurs but passes validation when a=0 and b=MAX_U256, breaking LST supply calculations? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Arithmetic Overflow] When adding boosted balances + accrued rewards in liquid staking, can the result wrap around u256 max causing the assertion 'c >= a' to pass with a wrapped smaller value, leading to incorrect total supply tracking? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Gas Griefing] Can an attacker repeatedly call vault deposit functions with values that trigger the overflow assertion at line 13, causing legitimate users' transactions to fail and creating a DoS on the protocol? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Precision Loss] When adding very large share amounts (near u256 max) with small fee amounts in basis points calculations, can the overflow check pass but the result lose precision in subsequent division operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [State Inconsistency] If add() is used to accumulate validator weights across multiple epochs and an overflow occurs at epoch boundary, can the assertion revert cause partial state updates leaving validator pool in inconsistent state? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Race Condition] When multiple concurrent operations (stake + reward distribution) both call add() on the same pool balance, can the overflow check execute on stale values allowing double-spend if the addition succeeds before state is committed? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: add()] [Integration Risk] When vault adaptors use add() to sum asset values from Navi, Suilend, Cetus, and Momentum with different decimal precisions (1e9 vs 1e18), can overflow occur during conversion causing total_usd_value to be catastrophically wrong? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Underflow Bypass] The assertion 'b <= a' checks before subtraction, but can reentrancy or state changes between check and subtraction cause 'a' to decrease, making 'a - b' underflow after the check passes? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Accounting Error] When withdrawing from vault and sub() is used to calculate remaining shares, if the assertion at line 19 reverts due to insufficient balance, can request buffers become desynchronized from actual vault balances? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Fee Bypass] When calculating net amounts after fee deduction (amount - fee), can an attacker pass b > a intentionally to trigger assertion revert, bypassing fee collection in a try-catch wrapper that swallows the error? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Loss Tolerance] When checking vault loss_tolerance per epoch using sub(previous_value, current_value), can the assertion prevent legitimate loss recording if current_value < previous_value, causing the protocol to fail during market downturns? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Slippage Manipulation] When processing withdraw requests with expected_amount slippage checks, can an attacker cause sub() to revert by front-running to make actual amount < expected amount, forcing user's withdrawal to fail and locking funds? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Validator Pool] When removing delegation from a validator using sub(total_stake, removed_amount), can the assertion revert if removed_amount was inflated by precision errors in ratio calculations, causing unstake operations to permanently fail? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Oracle Price] When calculating price differences using sub(current_price, previous_price) for staleness checks, can the assertion revert during price crashes where current < previous, preventing critical oracle updates? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: sub()] [Reward Distribution] When subtracting burned shares from total supply after unstaking, can rounding errors cause burned_shares > total_supply, triggering assertion and breaking the entire unstake mechanism? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Overflow Detection Flaw] The overflow check 'c / a == b' at line 31 uses division to verify multiplication, but can this fail to detect overflow if both a and b are carefully chosen such that the wrapped result divided by a still equals b? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Zero Short Circuit] When a=0, mul() returns 0 immediately without checking b's validity - can this allow malicious calls with b=invalid_value to bypass validation checks that should have been performed on b in the calling context? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Share Calculation] When calculating shares = amount * total_shares / total_assets, if mul(amount, total_shares) overflows but the overflow check passes due to specific value relationships, can users mint unlimited shares? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Fee Calculation] When computing fees as mul(amount, fee_bps) where fee_bps is in basis points (max 10000), can overflow occur if amount is near u256 max, causing fee collection to fail and allowing fee-free operations? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Price Conversion] When converting between 1e9 and 1e18 decimal precision using mul(value, 1e9), can overflow occur for large asset values causing oracle price feeds to revert and DoS the entire vault? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Ratio Amplification] When calculating boosted balances using mul(base_amount, boost_multiplier), can carefully chosen multiplier values cause overflow only on specific user balances, allowing an attacker to DoS specific large holders? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Validator Weight] When multiplying validator stake by weight factor for delegation distribution, can overflow cause the assertion to revert, preventing proper delegation and concentrating risk on fewer validators? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Cross-Protocol] When Navi adaptor calculates collateral value as mul(amount, price), can overflow on high-value positions cause health factor checks to fail, preventing legitimate borrows and breaking the vault's DeFi strategies? (High)",
  "[File: volo-vault/local_dependencies/protocol/math/sources/safe_math.move] [Function: mul()] [Reward Accrual] When computing accumulated rewards over multiple epochs as mul(reward_rate, epochs_elapsed), can overflow block reward distribution after sufficient time has passed, permanently locking rewards? (High)"
]