[
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Index Precision Loss] storage::get_index() returns (supply_index, borrow_index) as u256 - if these have different decimal precision than balance calculations, could rounding errors accumulate across many users leading to protocol insolvency? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Total Supply/Borrow Mismatch] Function returns both values but doesn't validate their relationship - could corrupted storage return total_borrow > total_supply violating lending protocol invariants and causing liquidation cascades? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Last Update Timestamp Staleness] Returns last_update_at without current timestamp comparison - could callers use extremely stale data (hours/days old) for critical operations like liquidations if they don't validate freshness? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [LTV Bounds Validation] Function returns ltv (loan-to-value) without bounds checking - could malicious or corrupted storage values >100% enable infinite borrowing against collateral or <0% values cause borrow denial? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Treasury Factor Overflow] If treasury_factor and reserve_factor are both near maximum values and interest calculations multiply them, could overflow cause treasury to lose fees or protocol to become insolvent? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Treasury Balance Manipulation] Returns treasury_balance without access control on who can query - could attackers monitor treasury accumulation to time governance attacks or extract value through protocol upgrades? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Interest Rate Model Parameters] Returns base_rate, multiplier, jump_rate_multiplier without validating their mathematical relationship - could invalid parameters cause negative rates, infinite rates, or non-monotonic rate curves breaking lending economics? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Reserve Factor Bounds] Returns reserve_factor without ensuring it's <100% - could values >=100% mean protocol takes more than 100% of interest, breaking repayment calculations or causing integer underflow in user interest credits? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Optimal Utilization Validation] Returns optimal_utilization without bounds check - if >100% or 0%, could interest rate calculations divide by zero or use invalid formulas causing borrow/supply rate manipulation? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Liquidation Ratio Consistency] Returns liquidation_ratio, liquidation_threshold, and liquidation_bonus separately - if their mathematical relationship is violated (e.g., ratio < threshold), could liquidations become impossible or profitable beyond bonus, enabling protocol drain? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Liquidation Bonus Overflow] If liquidation_bonus >100%, liquidators receive more than borrower's collateral - could this incentivize self-liquidation attacks where users borrow against their own collateral then liquidate themselves for profit? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Liquidation Threshold Edge Case] If liquidation_threshold equals ltv exactly, users could borrow maximum and be instantly liquidatable - could attackers exploit this to force liquidations immediately after borrows, profiting from liquidation bonuses? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Coin Type String Parsing] Returns coin_type as String - if this contains special characters or is malformed, could downstream parsing fail causing DoS when trying to identify asset types for vault operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Function: get_reserve_data()] [Oracle ID Mismatch] Returns oracle_id per reserve - if this doesn't match actual oracle configuration or points to wrong price feed, could entire reserve be priced incorrectly enabling massive arbitrage or bad debt? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: OracleInfo] [Data Validation] OracleInfo struct contains valid flag but no timestamp - could callers accept old valid=true prices that are now stale but weren't invalidated, using outdated prices for critical vault value calculations? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: OracleInfo] [Price Precision] price field is u256 but decimals is u8 - if decimals=0 or >77, could price calculations overflow/underflow when converting to USD values for vault operations? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: UserStateInfo] [Asset ID Type] asset_id is u8 limiting to 256 assets - if protocol expands beyond this, could ID collisions occur causing users to see merged balances of different assets? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: UserStateInfo] [Balance Overflow] borrow_balance and supply_balance are u256 - in extreme cases where many users deposit/borrow, could individual balance queries overflow storage limits causing state corruption? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: ReserveDataInfo] [Parameter Count] Struct has 24 fields - if any storage getter returns default/zero values for missing fields, could callers fail to detect misconfigured reserves and allow unsafe operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Struct: ReserveDataInfo] [Rate Units Ambiguity] supply_rate and borrow_rate are u256 without unit specification - if callers assume wrong time unit (per second vs per year) or wrong decimals, could display incorrect APYs misleading users into bad positions? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Module: getter] [No Access Control] All functions are public with no capability checks - could malicious contracts repeatedly call these causing storage read DoS or extracting information for MEV attacks? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Module: getter] [Mutable Reference Pattern] Multiple functions take &mut Storage despite being read-only - is this pattern intentional for interest accrual, or could it indicate missing const correctness that allows unintended mutations? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Module: getter] [No Event Emission] Functions perform no event emission - if these are used in critical paths, could lack of audit trail hide exploitation or make post-mortem analysis impossible after an attack? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Module: getter] [Gas Optimization] Functions iterate through all reserves/assets without pagination - could attackers cause gas exhaustion by increasing reserve count or querying users with maximum positions forcing unbounded iteration? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Integration: oracle::get_token_price()] [Oracle Module Trust] Function trusts oracle module completely - if oracle has vulnerabilities or can be manipulated, could all price data returned be malicious enabling vault value manipulation attacks? (Critical)"
]