[
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Authorization Bypass] Can an attacker call split_coin() directly to extract coins from vault operations by providing a malicious coin object, bypassing vault access controls since the function is public with no capability checks? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Authorization Bypass] If split_coin() is called within a vault operation context, can an attacker front-run the transaction to manipulate tx_context::sender() and redirect the remainder coin transfer to their address instead of the legitimate user? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin_to_balance()] [Authorization Bypass] Can split_coin_to_balance() be exploited by malicious vault adaptors to split user coins and redirect remainders to attacker addresses since it lacks capability-based access control? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Caller Validation] Does the public_transfer on line 24 create a vulnerability where an attacker can call this function with another user's coin object if they gain temporary access, causing the remainder to be sent to the current caller instead of the original coin owner? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Access Control] Can an operator with vault privileges abuse split_coin() to extract partial amounts from deposit/withdrawal request coins and redirect remainders to their own address via tx_context manipulation? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Integer Overflow] If amount parameter equals u64::MAX and coin_value also equals u64::MAX, does the assertion on line 14 pass but cause overflow in subsequent coin::split() operation leading to incorrect value splits? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Amount Validation] Can an attacker pass amount = coin_value to split the entire coin, causing line 18's check to evaluate true and destroy the original coin, but potentially breaking vault accounting if the vault expects the remainder to exist? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Zero Amount Check] The assertion on line 13 rejects amount = 0, but what if amount = 1 and this causes dust amounts that break vault share calculations or fee collection when repeatedly called? (Low)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Boundary Condition] If amount = coin_value - 1, leaving only 1 unit as remainder, does transferring this dust amount on line 24 create gas griefing vectors or break minimum balance requirements in vault operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Amount Precision] Can repeated calls to split_coin() with small amounts cause precision loss or rounding errors that compound in vault share calculations, leading to share inflation/deflation vulnerabilities? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Coin Destruction] If coin::value(&split_coin) == 0 on line 18 after split, the function destroys the coin with coin::destroy_zero(), but what if the vault expects this coin object to persist for tracking purposes, breaking vault state? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Zero Coin Handling] Can an attacker craft a scenario where coin::split() on line 17 leaves split_coin with zero value, triggering destroy_zero on line 19, but the returned split_ coin is also manipulated to cause accounting errors in vault deposit tracking? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [State Consistency] After coin::destroy_zero() executes on line 19, does the vault lose reference to the original coin object ID, potentially breaking deposit receipt matching or request buffer tracking? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Coin Lifecycle] If the zero-value branch executes (line 18-21), does early return bypass any cleanup logic that caller modules expect, causing state inconsistency in vault operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Transfer Recipient] On line 24, public_transfer sends remainder to tx_context::sender(ctx), but if this is called from a vault adaptor contract, does sender() resolve to the adaptor address instead of the end user, causing fund loss? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Recipient Confusion] If split_coin() is invoked by a vault operator on behalf of a user, does the remainder transfer to operator (sender) instead of user, enabling operator to steal excess funds? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Multi-Sig Context] In a multi-sig vault setup, if split_coin() executes within a shared transaction, which signer becomes tx_context::sender() for the remainder transfer, and can this be exploited to redirect funds? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Cross-Module Transfer] When vault modules call split_coin(), does public_transfer on line 24 create a re-entrancy vector if the recipient (sender) is a malicious contract that can execute code upon receiving coins? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Transfer Finality] Is there a timing window between coin::split() on line 17 and public_transfer on line 24 where an attacker can manipulate transaction context or exploit race conditions to redirect the remainder? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin_to_balance()] [Balance Conversion] Does coin::into_balance() on line 33 perform any validation, or can it convert a zero-value coin into a Balance object that breaks vault accounting when added to deposit buffers? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin_to_balance()] [State Transition] If split_coin() on line 30 transfers the remainder to sender, but the returned split coin is converted to Balance on line 33, does this create inconsistency where vault expects full coin value but only receives split amount? (High)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin_to_balance()] [Balance Tracking] After into_balance() converts the coin on line 33, does the vault lose ability to track the original coin object for receipt matching or withdrawal fulfillment? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin_to_balance()] [Type Conversion] Can the Balance returned on line 34 be exploited if vault code assumes it receives a Coin object instead of Balance, causing type confusion in subsequent operations? (Low)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Reentrancy] If split_coin() is called during a vault deposit operation and the remainder transfer on line 24 triggers a callback to a malicious contract, can the attacker re-enter vault functions before the original deposit completes? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/utils/sources/utils.move] [Function: split_coin()] [Transaction Context] Can an attacker manipulate the TxContext passed to split_coin() to change sender() resolution, causing remainder transfers to unintended recipients in vault workflows? (High)"
]