[
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Immutability] Are all WithdrawRequest fields immutable after creation, or can package-visible functions modify them to bypass original user intent? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [State Mutation] [Field Modification] Can the vault or other package modules obtain mutable references to stored WithdrawRequest objects and alter fields like recipient or expected_amount? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [State Mutation] [Request Substitution] Can a legitimate WithdrawRequest in the buffer be replaced with a modified copy, redirecting withdrawals or changing slippage terms? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Lifecycle] [Request Expiration] Does WithdrawRequest lack an expiration time, allowing ancient requests to remain valid indefinitely even after market conditions change drastically? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Lifecycle] [Stale Request Execution] Can WithdrawRequest objects created months ago be executed with outdated expected_amount, bypassing current slippage protection? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cleanup] [Memory Leak] If WithdrawRequest execution or cancellation fails, can the request remain in buffer permanently, causing storage leaks and gas exhaustion? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cleanup] [Orphaned Shares] If a WithdrawRequest is dropped without cleanup, are the shares permanently locked, or is there a mechanism to recover them? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cross-Module] [Vault Status] Can WithdrawRequest be created when vault is in 'during_operation' or 'disabled' status, bypassing status gate checks? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cross-Module] [Operator Freeze] If operator is frozen, can they still execute or cancel WithdrawRequest objects they previously created? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cross-Module] [Adaptor Interaction] Can WithdrawRequest execution trigger adaptor operations that are unauthorized or violate health limits? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cross-Module] [Fee Config] Can fee_config be changed after WithdrawRequest creation, causing users to pay unexpected fees during execution? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Cross-Module] [Pause Flag] If vault is paused after WithdrawRequest creation, can the request still be executed or cancelled, bypassing emergency pause? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Economic] [Front-Running] Can large WithdrawRequest objects be front-run by others who observe pending requests and execute first, depleting vault liquidity? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Economic] [MEV Extraction] Can MEV bots monitor WithdrawRequest creation events and extract value by manipulating vault state before execution? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Economic] [Withdrawal Rush] Can mass WithdrawRequest creation cause a bank run, where early executors drain vault while later requests fail due to insufficient funds? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Economic] [Liquidity Fragmentation] Can numerous small WithdrawRequest objects fragment vault liquidity, making it impossible to execute large withdrawals? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Game Theory] [Griefing] Can attackers create WithdrawRequest objects with impossible expected_amount to grief other users by consuming request buffer space? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Type Safety] [Generic Mismatch] Does WithdrawRequest lack generic type parameter for PrincipalCoinType, enabling cross-type withdrawal requests that could drain wrong asset pools? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Type Safety] [Address Casting] Can receipt_id, recipient, or vault_id addresses be cast to incompatible object types during execution, causing type confusion? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Type Safety] [U256/U64 Conversion] Are there unchecked conversions between u256 shares and u64 amounts that could cause truncation or overflow? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Edge Case] [Zero Everything] Can a WithdrawRequest be created with all numeric fields (request_id, shares, expected_amount, request_time) set to zero? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Edge Case] [Max Values] Can a WithdrawRequest be created with all numeric fields set to maximum values (u64::max, u256::max), causing arithmetic overflows everywhere? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Edge Case] [Same Address] Can receipt_id, recipient, and vault_id all be the same address, creating degenerate cases in validation logic? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Edge Case] [Request Spam] Can an attacker create millions of tiny WithdrawRequest objects (1 share each) to DoS the request buffer and execution queue? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Edge Case] [Precision Loss] If shares is 1 and share ratio is very small, can expected_amount round to zero, causing free withdrawals or execution failures? (Medium)"
]