[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Authorization Bypass] Can an attacker with access to a valid Queue object but without authority exploit timing windows between has_authority() check and actual authority update to bypass authorization? Precondition: Attacker obtains Queue reference. Violated invariant: Only current authority should update authority. Impact: Unauthorized authority transfer. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Authorization Bypass] If has_authority() in queue module uses ctx.sender() comparison, can an attacker create a sponsored transaction where the sender appears legitimate but the authority transfer benefits a malicious address? Precondition: Sponsored transactions enabled. Violated invariant: Authority verification must match actual transaction initiator. Impact: Privilege escalation. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Authorization Bypass] Can validate() be bypassed by calling actuate() directly if it's not marked as private? Precondition: actuate() has insufficient visibility restrictions. Violated invariant: validate() must always precede actuate(). Impact: Unauthorized authority changes without validation checks. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Access Control] If Queue is a shared object, can multiple transactions race to call run() simultaneously, causing the second transaction to fail or succeed with stale authority checks? Precondition: Queue shared, concurrent transactions. Violated invariant: Authority checks should be atomic with updates. Impact: Race condition allowing invalid authority changes. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Authorization Bypass] Can the new_authority address be set to 0x0 or an invalid address, effectively bricking the Queue by making it impossible for anyone to have authority? Precondition: No validation on new_authority parameter. Violated invariant: new_authority must be valid and non-zero. Impact: Permanent loss of Queue control (DoS). (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Authorization] Can new_authority be set equal to existing_authority, creating unnecessary events and potential confusion in off-chain monitoring systems? Precondition: No check for new_authority != existing_authority. Violated invariant: Authority updates should only occur on actual changes. Impact: Event spam, monitoring confusion. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Access Control] If the Queue object has multiple authorities through a multi-sig or capability system not visible in this module, can a single authority holder unilaterally transfer authority without consensus? Precondition: Queue has multi-party governance. Violated invariant: Authority transfer should require consensus. Impact: Centralization risk, governance bypass. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Authorization] Can has_authority() be manipulated if the queue module's implementation is vulnerable to address spoofing or if ctx can be tampered with? Precondition: Weak has_authority() implementation. Violated invariant: Authority must be cryptographically verified. Impact: Complete authority takeover. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Version Mismatch] Can an attacker create a Queue with version != 1 and use older vulnerable authority update logic from a different action module? Precondition: Multiple queue versions exist. Violated invariant: Only version 1 queues should be modifiable. Impact: Bypass of current security checks. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Version Check Bypass] If EXPECTED_QUEUE_VERSION is a constant, can an attacker fork this module with a different version constant to operate on incompatible Queue objects? Precondition: Module can be deployed by anyone. Violated invariant: Version compatibility must be enforced protocol-wide. Impact: Cross-version contamination attacks. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Version Validation] What happens if Queue.version is upgraded to 2+ in the future but this action module is not updated? Will legitimate users be unable to transfer authority? Precondition: Queue version upgraded. Violated invariant: Action modules should support current queue versions. Impact: DoS for authority transfers (availability failure). (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Version Rollback] Can an attacker downgrade Queue.version from 2 to 1 in another module to make this action work on incompatible queues, bypassing newer security features? Precondition: Queue.version is mutable elsewhere. Violated invariant: Version should be immutable or strictly increasing. Impact: Security feature bypass via version manipulation. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Event Ordering] Can the QueueAuthorityUpdated event be emitted after set_authority() succeeds but before the transaction commits, causing off-chain systems to process an incomplete state change? Precondition: Transaction aborts after event emission. Violated invariant: Events should only represent committed state changes. Impact: Off-chain desync, incorrect authority assumptions. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Event Manipulation] If event::emit() can fail silently, can the authority be updated without emitting QueueAuthorityUpdated, causing off-chain systems to miss the change? Precondition: event::emit() fails. Violated invariant: All authority changes must be logged. Impact: Stealth authority changes, audit trail gaps. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [State Inconsistency] If queue.set_authority() modifies multiple fields or has side effects, can the event's existing_authority field become stale or mismatched with actual state? Precondition: set_authority() has complex implementation. Violated invariant: Event data must match actual state transition. Impact: Event data corruption, off-chain confusion. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Event Data Integrity] Can an attacker front-run run() with another authority change, making the emitted existing_authority in the second transaction's event incorrect? Precondition: Multiple concurrent authority changes. Violated invariant: Event existing_authority should match pre-transaction state. Impact: Misleading event logs, broken audit trails. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Atomicity] If validate() passes but actuate() fails mid-execution, is there a partially-updated state where authority is changed but event not emitted? Precondition: actuate() throws error after set_authority(). Violated invariant: Authority update and event emission must be atomic. Impact: Inconsistent state, missing events. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Reentrancy] Can the new_authority address be a contract that implements a callback on receiving authority, allowing it to call run() again before the first call completes? Precondition: new_authority is malicious contract. Violated invariant: Authority transfer should be non-reentrant. Impact: Reentrancy leading to double authority updates or state corruption. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Cross-Module Reentrancy] If queue.set_authority() triggers callbacks to other modules that can call back into queue_set_authority_action, can this create circular authority transfer loops? Precondition: set_authority() has side effects. Violated invariant: Authority updates should be isolated. Impact: State corruption via recursive calls. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Callback Vulnerability] If Queue has hooks or observers that get notified on authority changes, can malicious observers block or revert the transaction by failing in their callback? Precondition: Queue implements observer pattern. Violated invariant: Authority updates should not be blockable by observers. Impact: DoS of authority transfers. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Front-Running] Can an attacker observe a pending run() transaction and front-run it with their own authority transfer to themselves, then back-run to restore original authority, extracting value in between? Precondition: Public mempool, Queue controls valuable assets. Violated invariant: Authority should not be rapidly transferable. Impact: MEV extraction, temporary authority abuse. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Sandwich Attack] Can an attacker sandwich a legitimate authority transfer between two of their own transactions to manipulate Queue state or extract fees? Precondition: Queue fee-generating operations. Violated invariant: Authority transfers should not be exploitable for MEV. Impact: Value extraction via transaction ordering. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Race Condition] If two legitimate parties both try to call run() to set themselves as authority, which one succeeds is determined by transaction ordering—can this be gamed? Precondition: Contentious authority claims. Violated invariant: Authority resolution should be deterministic. Impact: Authority ambiguity, governance disputes. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Invalid Parameter] Can new_authority be set to the Queue's own ID/address, creating a circular authority reference that breaks authorization logic? Precondition: No validation preventing self-authority. Violated invariant: Authority must be external entity. Impact: Queue becomes unusable, authority checks fail. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Address Validation] Can new_authority be a burn address (0x0, 0x...dead) effectively making the Queue ownerless and unmanageable? Precondition: No address validation. Violated invariant: Authority must be accessible. Impact: Permanent loss of Queue control. (Critical)"
]