[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Type Confusion] Can the Queue parameter be substituted with a different type that implements similar methods, bypassing the intended queue module's security checks? Precondition: Weak type enforcement. Violated invariant: Queue type must be exact, not duck-typed. Impact: Authority set on wrong object types. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Reference Safety] The queue parameter is &mut Queue—can multiple mutable references exist simultaneously, allowing concurrent modifications that violate Rust's borrowing rules? Precondition: Unsafe code or reference aliasing. Violated invariant: Only one mutable reference should exist. Impact: Data races, state corruption. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Inconsistent Validation] Do queue_set_configs_action, queue_override_oracle_action, and other queue actions use identical validation logic, or can inconsistencies be exploited? Precondition: Different validation across actions. Violated invariant: All queue actions should have consistent security checks. Impact: Exploiting weakest action's validation. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Action Composition] Can an attacker combine run() with other queue actions in a single transaction to create exploitable state transitions? Precondition: Multiple actions callable in one transaction. Violated invariant: Action composition should be safe. Impact: Complex attack chains via action chaining. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Boolean Logic] Can the assert!() conditions be satisfied through unexpected boolean algebra, such as short-circuiting or operator precedence issues? Precondition: Complex boolean expressions. Violated invariant: Assertions should be unambiguous. Impact: Logic bypasses. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Equality Check] The version check uses ==—can version values be crafted (e.g., via overflow/underflow) to equal EXPECTED_QUEUE_VERSION while actually being different? Precondition: Arithmetic manipulation possible. Violated invariant: Version comparison should be robust. Impact: Version check bypass via arithmetic tricks. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Object Ownership] If Queue is a shared object, can ownership/authority semantics be confused between Sui's object ownership model and application-level authority? Precondition: Sui object model complexity. Violated invariant: Ownership and authority should align. Impact: Confused deputy attacks via ownership/authority mismatch. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [TxContext Manipulation] Can the TxContext parameter be manipulated or spoofed by malicious validators or through transaction replay attacks? Precondition: Weak TxContext integrity. Violated invariant: TxContext must be trustworthy. Impact: Context manipulation enabling authority bypass. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Programmable Transaction Blocks] In Sui's PTB model, can an attacker chain multiple run() calls in a single PTB to rapidly cycle authority and exploit intermediate states? Precondition: PTBs allow complex transaction graphs. Violated invariant: Authority should be stable within transaction. Impact: Authority cycling attacks via PTB. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [ID Stability] queue.id() returns an ID—can this ID change or be manipulated between validate() and actuate() calls, causing event logging issues? Precondition: Object IDs are mutable. Violated invariant: Object IDs should be immutable. Impact: Event data corruption. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Upgrade Compatibility] If this module is upgraded to add new validation checks, will existing in-flight transactions fail or succeed with old validation logic? Precondition: Module upgrade during transaction execution. Violated invariant: Upgrades should not break in-flight transactions. Impact: Transaction failures, inconsistent behavior. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Migration Path] If Queues need to migrate from version 1 to version 2, does this action provide a safe migration path for authority transfers during the upgrade window? Precondition: Version migration in progress. Violated invariant: Authority should remain transferable during migrations. Impact: Authority transfer DoS during upgrades. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Signature Replay] If has_authority() relies on signatures, can an attacker replay old authority transfer signatures after authority has changed? Precondition: Signature-based auth without nonces. Violated invariant: Signatures should be non-replayable. Impact: Replay attacks enabling unauthorized transfers. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Key Rotation] If the current authority's keys are compromised and they try to transfer authority to a new secure address, can the attacker front-run and transfer to themselves first? Precondition: Compromised keys, public mempool. Violated invariant: Key rotation should be protected from front-running. Impact: Permanent authority loss. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Self-Transfer] Can authority be transferred to the same address it currently has (authority = new_authority), and if so, does this have any unintended side effects? Precondition: new_authority == existing_authority. Violated invariant: Self-transfers should be idempotent or disallowed. Impact: Unnecessary events, potential side effects. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Authority Chain] If authority is rapidly transferred A→B→C→A, can this create circular references or confusion in dependent systems tracking authority history? Precondition: Rapid authority cycling. Violated invariant: Authority changes should maintain clear lineage. Impact: Authority tracking confusion. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Multi-Queue Management] If an authority manages multiple queues and tries to transfer them all in a batch, can partial failures leave queues in inconsistent authority states? Precondition: Batch authority transfers. Violated invariant: Batch operations should be atomic or clearly partial. Impact: Inconsistent multi-queue states. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Fee Manipulation] If Queue has fee structures and authority controls fee settings, can an attacker temporarily gain authority, change fees to extract value, then transfer authority back? Precondition: Authority controls fees. Violated invariant: Authority transfers should not enable fee manipulation attacks. Impact: Economic exploitation via temporary authority. (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Gas Griefing] Can an attacker who has authority repeatedly transfer it back and forth to drain gas from a multi-sig or DAO wallet trying to maintain authority? Precondition: Authority held by organization with limited gas budget. Violated invariant: Authority transfers should not be gas weaponizable. Impact: Financial DoS via gas exhaustion. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Event Data Race] If queue.authority() and queue.id() are read at slightly different times, can a concurrent modification cause event to log inconsistent data? Precondition: Concurrent Queue modifications possible. Violated invariant: Event data must be snapshot-consistent. Impact: Event data corruption. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: actuate()] [Struct Copying] QueueAuthorityUpdated has 'copy' ability—can unintended copying of this event struct lead to duplicate or manipulated events? Precondition: Event struct copied maliciously. Violated invariant: Events should only be emitted once per change. Impact: Duplicate events confusing off-chain systems. (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Shared Object Contention] If Queue is shared and multiple transactions try to call run() simultaneously, can Sui's object versioning cause unexpected transaction ordering or conflicts? Precondition: High contention on Queue object. Violated invariant: Authority changes should have deterministic ordering. Impact: Non-deterministic authority updates. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: validate()] [Consensus Timing] Can validate() pass at consensus time but state change between consensus and execution, making actuate() operate on stale assumptions? Precondition: Consensus-execution gap. Violated invariant: Validation should be valid at execution time. Impact: TOCTOU between consensus and execution. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Volo Vault Dependency] If Volo Vault's health limiter or oracle price feeds depend on this queue's authority being secure, can authority compromise cascade to vault exploits? Precondition: Vault trusts queue authority. Violated invariant: Queue authority compromise should be isolated. Impact: Cross-protocol exploitation. (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/queue/queue_set_authority_action.move] [Function: run()] [Oracle Feed Manipulation] Given Switchboard provides on-demand oracle data, can malicious authority manipulation enable price feed attacks on Volo's liquid staking or vault operations? Precondition: Queue provides critical price feeds. Violated invariant: Oracle data must remain tamper-proof. Impact: Vault/LST price manipulation, fund theft. (Critical)"
]