[
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Rebalance Path] Does rebalance() skip check_not_paused() since it's operator-gated, and can this enable operator to rebalance towards malicious validators while pool is emergency-paused? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Constants: EIncompatibleVersion] Error code 50001 - can this overlap with error codes in stake_pool (30000s) or validator_pool modules, causing confusion in error handling and masking real security issues? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Constants: EIncompatiblePaused] Error code 50002 - if another module reuses this code, can error messages mislead auditors about which module failed, hiding the true root cause of exploits? (Low)",
  "[File: liquid_staking/sources/manage.move] [Constants: VERSION] Hardcoded VERSION=2 - if package upgrade increments this but forgets to update migration logic in stake_pool, can users be permanently locked out due to failed version checks? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Boundary Check] The assert allows self.version <= VERSION - what happens at exact equality (version==VERSION)? Does calling migrate_version() when already migrated waste gas or cause unexpected state changes? (Low)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Strict Equality] Using == instead of >= means old version clients are rejected - can this cause DOS during upgrade window where users with old transactions in mempool are permanently rejected? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: new()] [Default State] Starting with paused=true - if create_stake_pool() succeeds but subsequent set_paused(false) transaction fails, do all user funds become permanently locked in an unoperable pool? (High)",
  "[File: liquid_staking/sources/manage.move] [Struct: Manage] [Field Access] With only store ability (no copy/drop), can the Manage struct be moved out of StakePool by a malicious package module, leaving StakePool without version/pause protection? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Zero Version] If a bug causes self.version to be 0, does the check fail permanently, bricking the entire StakePool with no recovery path? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Epoch Dependency] Does migration lack epoch-based gating, allowing admin to migrate mid-epoch and disrupting reward calculations or validator stake activations? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Timing Attack] Can an attacker observe pending set_paused(true) transaction in mempool and front-run with maximum unstake, extracting funds before emergency pause activates? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Upgrade Race] During package upgrade deployment, can transactions using old version code race with upgrade transaction, causing half of users to operate on v1 and half on v2 simultaneously? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Invariant] After migration, are LST supply, SUI balance, and validator delegations validated to maintain ratio invariants, or can migration cause permanent supply/balance mismatch? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Fee Collection] If pool is paused while fees are accrued, can collect_fees() be called in paused state, and does this violate the invariant that paused pools should be completely frozen? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Validator Operations] Can add_validator() or remove_validator() be called while paused, changing pool composition when users expect frozen state, violating pause invariant? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Boosted Balance] Does migration preserve boosted_balance and accrued_reward_fees correctly, or can version change reset these values, stealing user rewards? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [DOS] If VERSION is incremented but migrate_version() is never called (admin key lost), does check_version() permanently brick all stake/unstake functions, locking billions in TVL? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Griefing] Can a malicious admin pause pool indefinitely without unstaking users, forcing them to hold illiquid LST tokens while SUI validators continue earning rewards for the pool? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Gas Griefing] Does migration require multiple transactions due to validator_pool size, and can an attacker DOS the migration by front-running each step with validator additions? (Medium)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Fee Extraction] While pool is paused, can admin call update_stake_fee() to set fee to maximum (10000 bps = 100%), then unpause and collect all user stakes as fees on next epoch? (Critical)",
  "[File: liquid_staking/sources/manage.move] [Function: set_paused()] [Reward Timing] If paused immediately before epoch boundary, do validator rewards still accrue to pool, but users can't unstake to realize gains, effectively confiscating rewards? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Fee Reset] Can migration reset fee_config to default values, and does this allow admin to bypass max fee caps set in old version, extracting excessive fees post-migration? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_not_paused()] [Validator Delegation] Does delegate_stake() skip check_not_paused(), allowing direct validator deposits while pool is paused for regular users, creating unfair access? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: check_version()] [Split SUI] When split_n_sui() is called from unstake(), is version checked in validator_pool too, or can version mismatch cause under-payment by using old ratio calculation? (High)",
  "[File: liquid_staking/sources/manage.move] [Function: migrate_version()] [Pending Stakes] If validators have pending stake activation during migration, does version change disrupt the activation flow, causing stakes to be lost or double-counted? (Critical)"
]