[
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Rate Manipulation] Attacker checks rates via getter, executes large deposit to change utilization, then profits from predicted rate change in same transaction block? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Liquidation Front-Running] Bot monitors get_user_state() for users near liquidation threshold and front-runs price updates to liquidate first? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Supply Cap Race] Multiple users check supply cap via getter and simultaneously deposit, exceeding cap - who gets reverted and is this DoS-able? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Index Arbitrage] Attacker monitors when indices haven't updated recently via last_update_at, borrows before index update to get outdated interest rate? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Treasury Drain] Malicious actor monitors treasury_balance growth via getter and times governance proposals to redirect treasury at peak value? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Multi-Reserve Exploit] Attacker finds reserve with misconfigured LTV via getter and uses it as over-leveraged collateral to drain other reserves? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Decimal Exploit] Attacker identifies oracle with wrong decimals via getter and exploits price conversion errors to manipulate collateral value? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Staleness Exploitation] Attacker detects stale last_update_at timestamps via getter and exploits period when interest not accrued to borrow interest-free? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Attack: Configuration Gaming] Attacker analyzes all reserve configs via getter to find optimal combination for leveraged positions exploiting parameter interactions? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 19-30] The while loop decrements length but uses length-1 for indexing - is there guarantee that vector::borrow won't panic if vector is modified during iteration by storage module? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 21] oracle::get_token_price returns (valid, price, decimals) tuple - if oracle module has bug returning incorrect tuple order, could price and decimals be swapped causing catastrophic mispricing? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 47] storage::get_user_balance called with length-1 as reserve ID - if storage uses this as array index and reserves array shrinks during iteration, could this access out-of-bounds memory? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 92-105] Function makes 15 separate storage calls - if storage uses lazy initialization and any call initializes missing data, could this cause side effects violating read-only assumption? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 104] get_borrow_rate_factors returns 5-tuple - if tuple order is wrong or storage returns incorrect tuple size, could this cause runtime panic or parameter misassignment? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Line 105] get_liquidation_factors returns 3 values - if these aren't validated to maintain liquidation_ratio < liquidation_threshold < 100%, could protocol allow impossible liquidations? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Copy vs Drop Traits] All structs have 'copy, drop' - does copying large u256 vectors have performance implications? Could this cause DoS through excessive copying in loops? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Storage Mutation] Why do read-only getters require &mut Storage? Is this for interest accrual? If so, are there reentrancy concerns if accrual triggers callbacks? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_ui/sources/getter.move] [Deep Dive: Vector Ordering] Info vectors are built in reverse order - if callers depend on specific ordering and don't account for reversal, could index misalignment cause wrong asset operations? (Medium)"
]