[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Integration: calculate_amplitude() + to_target_decimal_value_safe()] Can an attacker pass two prices with different decimals to calculate_amplitude() without first normalizing via to_target_decimal_value_safe(), causing amplitude to be calculated on incomparable values and breaking price deviation detection? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Integration: to_target_decimal_value() + calculate_amplitude()] If vault code converts prices using to_target_decimal_value() before amplitude check, can precision loss from conversion cause two materially different prices to appear similar, allowing large deviations to pass through? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Integration: U64MAX constant usage] U64MAX is defined locally but also used in return values, can inconsistent interpretation of this sentinel value across vault contracts cause amplitude checks to be incorrectly bypassed? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Integration: Multiple constants::multiple() calls] calculate_amplitude() calls constants::multiple() which could change in an upgrade, can this cause amplitude calculations to become incompatible with historical checks stored in vault state? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Integration: Decimal conversion before amplitude] If prices are converted to different target_decimals before calculating amplitude, can this cause artificially high amplitude due to different precision levels rather than real price deviation? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Oracle Integration] When vault calls to_target_decimal_value_safe() for Switchboard oracle prices (typically 9 decimals) converting to vault internal format (e.g., 6 decimals), can rounding errors accumulate across multiple assets to create exploitable price discrepancies? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Oracle Integration] If vault uses calculate_amplitude() to compare Switchboard on-demand prices with cached prices, can an attacker manipulate the timing of price updates to always trigger U64MAX returns (indicating invalid comparison) and DoS vault operations? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Oracle Integration] When health limiter calls these functions to convert Navi oracle prices for health factor calculations, can precision loss in decimal conversion cause health factors to be incorrectly calculated as safe when positions are actually liquidatable? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Oracle Integration] Can an attacker exploit different decimal conventions across protocols (Navi uses 18, Sui uses 9, vault may use 6) by forcing conversions through to_target_decimal_value() in a specific order to maximize precision loss? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Oracle Integration] If vault receipt USD values are calculated using to_target_decimal_value_safe(), can an attacker deposit assets when conversion rounds down and withdraw when it rounds up, systematically extracting value from other users? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Vault Operations] When vault calculates total_usd_value by summing converted prices from multiple assets, can accumulated precision loss from repeated to_target_decimal_value_safe() calls exceed loss_tolerance threshold, triggering false operation failures? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Vault Operations] During vault share calculations, if asset prices are converted to target_decimal=6 but shares use decimal=9, can the decimal mismatch be exploited to mint more shares than deserved or burn fewer shares than required? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Vault Operations] Can an attacker repeatedly deposit and withdraw in the same epoch, each time triggering oracle price conversions via to_target_decimal_value(), to amplify rounding errors and drain vault value over many transactions? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Vault Operations] If calculate_amplitude() returns U64MAX for price comparison between pre-operation and post-operation snapshots, does vault treat this as a critical failure or continue operations, potentially allowing exploits to proceed undetected? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Vault Operations] When vault updates assets_value via oracle prices, can an attacker manipulate the target_decimal parameter passed to to_target_decimal_value_safe() to cause value updates to use incorrect decimal representations? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Adaptor Integration] When Navi adaptor converts oracle prices for borrowed asset valuation, can precision loss in to_target_decimal_value() cause borrow limits to be calculated incorrectly, enabling over-borrowing beyond safe health factors? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Adaptor Integration] If Cetus CLMM adaptor uses calculate_amplitude() to verify pool price matches oracle price, can U64MAX returns during pool price volatility cause legitimate operations to be blocked, DoSing Cetus integration? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Adaptor Integration] Can Suilend adaptor exploit decimal conversion functions by passing asset prices with non-standard decimals, causing vault to miscalculate collateral values and enabling excessive borrowing? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Adaptor Integration] When Momentum adaptor returns positions to vault, if position values are converted using different target_decimals than when borrowed, can this create artificial gains/losses exploitable for share price manipulation? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Mathematical Correctness] In to_target_decimal_value_safe(), is the iterative approach of multiplying/dividing by 10 mathematically equivalent to computing 10^(target_decimal - decimal) directly, or can rounding differences be exploited? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Mathematical Correctness] Does calculate_amplitude() correctly handle the case where a and b differ by exactly 'multiple', or can off-by-one errors in the comparison allow amplitude=10000 (100% deviation) to pass checks expecting amplitude<10000? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Mathematical Correctness] When target_decimal > decimal by large amounts (e.g., 20+), does repeated multiplication by 10 maintain numerical precision, or can floating point style errors emerge despite using integers? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Mathematical Correctness] In calculate_amplitude(), is dividing ab_diff by 'a' before checking U64MAX correct, or should the check happen after multiplication by multiple but before division to catch more overflow cases? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Edge Case] What happens if to_target_decimal_value_safe() is called with value=u256::MAX, decimal=0, target_decimal=255, can the extreme multiplication cause overflow wrap-around to small values despite overflow prevention comment? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Edge Case] If calculate_amplitude() receives a=1 and b=u256::MAX, does ab_diff calculation work correctly, or can the subtraction in abs_sub() cause issues despite underflow protection? (Medium)"
]