[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Precision] Does the iterative division by 10 in to_target_decimal_value_safe() always round down, and can this systematic bias be exploited over many conversions to drain value from vault? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Precision] When calculate_amplitude() divides ab_diff * multiple by 'a', does integer division round down the final amplitude, potentially allowing 99.9% deviations to appear as 99% and pass checks? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Rounding Mode] If vault code assumes rounding up in some contexts but these functions round down, can the mismatch create exploitable discrepancies in share price calculations? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Call Ordering] If vault code calls to_target_decimal_value() then to_target_decimal_value_safe() on the same value, can the different overflow handling cause inconsistent results exploitable for arbitrage? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Call Ordering] When calculate_amplitude() is called before vs after decimal conversion, can the ordering choice be exploited to manipulate which operations pass amplitude checks? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Error Handling] When to_target_decimal_value() aborts with error code 1, does vault have proper error recovery, or can this abort leave vault in an inconsistent state with locked user funds? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Error Handling] If calculate_amplitude() returns U64MAX due to overflow, how do vault operations interpret this sentinel value, and can misinterpretation enable bypassing safety checks? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Error Recovery] Can an attacker deliberately trigger aborts in to_target_decimal_value() during multi-step operations, leaving vault in a state where some assets are converted but others are not? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Access Control] These functions are public, can they be called by malicious contracts to pre-compute favorable oracle conversions before executing vault operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Access Control] If vault assumes these functions validate inputs rigorously but they don't, can malicious actors exploit the lack of validation to pass crafted oracle data? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Share Calculation] When vault mints shares based on USD value calculated via to_target_decimal_value_safe(), can precision loss cause shares to be minted at incorrect ratios, enabling share dilution attacks? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Share Calculation] If expected_shares calculations use different target_decimals than actual share calculations, can the expected_shares slippage check be bypassed through decimal manipulation? (High)"
]