[
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: zero()] [DoS/Critical Logic Error] All public functions immediately abort with 'abort 0' - if Volo vault or AMM math calls zero() to initialize I32 values, will this cause permanent DoS preventing vault operations, share calculations, or pool rebalancing? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: from_u32()] [DoS/Critical Logic Error] Function aborts unconditionally - if vault price calculations or fee computations require converting unsigned integers to signed I32 format via from_u32(), will all such operations revert causing vault lockup? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: from()] [DoS/Critical Logic Error] Function aborts unconditionally - if AMM tick math or liquidity calculations use from() to create signed integers, will this break Cetus/Momentum adaptor integration causing inability to execute swaps or manage positions? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: neg_from()] [DoS/Critical Logic Error] Function aborts unconditionally - if negative price movements or loss calculations require neg_from() to represent negative values, will vault loss tracking or health factor checks permanently fail? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: add()] [DoS/Arithmetic Failure] Function aborts unconditionally - if vault value aggregation or cumulative fee calculations call add() to sum I32 values, will this prevent total USD value updates breaking deposit/withdrawal operations? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: wrapping_add()] [DoS/Arithmetic Failure] Function aborts unconditionally - if AMM math uses wrapping_add() for overflow-safe tick calculations, will this break liquidity pool price updates in Cetus/Momentum adaptors? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: sub()] [DoS/Arithmetic Failure] Function aborts unconditionally - if vault loss calculation subtracts post-operation value from pre-operation value via sub(), will loss_tolerance enforcement fail causing undetected losses? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: wrapping_sub()] [DoS/Arithmetic Failure] Function aborts unconditionally - if price delta calculations use wrapping_sub() to handle tick movements, will oracle price updates or slippage checks permanently revert? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: mul()] [DoS/Arithmetic Failure] Function aborts unconditionally - if fee multiplier calculations or share ratio scaling uses mul() with signed integers, will all fee computations fail preventing operator rewards and protocol revenue? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: div()] [DoS/Arithmetic Failure] Function aborts unconditionally - if average price calculations or liquidity distribution uses div() for division, will vault rebalancing operations or share minting fail? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: mod()] [DoS/Arithmetic Failure] Function aborts unconditionally - if tick spacing validation or remainder calculations in AMM math use mod(), will position management in Cetus adaptors become impossible? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: abs()] [DoS/Conversion Failure] Function aborts unconditionally - if absolute value of price deltas or loss amounts uses abs() to convert signed to unsigned, will risk assessment or health checks fail? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: abs_u32()] [DoS/Conversion Failure] Function aborts unconditionally - if extracting unsigned magnitude from signed values via abs_u32() for fee calculations, will this prevent accurate accounting of deposits/withdrawals? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: as_u32()] [DoS/Conversion Failure] Function aborts unconditionally - if converting final I32 results back to u32 for storage or transfers via as_u32(), will all operations using signed math become unusable? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: cmp()] [DoS/Comparison Failure] Function aborts unconditionally - if price comparison logic or threshold checks use cmp() to compare signed values, will limit order execution or stop-loss mechanisms fail? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: eq()] [DoS/Comparison Failure] Function aborts unconditionally - if equality checks for zero balance or neutral positions use eq(), will vault state validation or assertion checks always fail? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: gt()] [DoS/Comparison Failure] Function aborts unconditionally - if greater-than checks validate minimum thresholds or profit conditions via gt(), will trade execution or withdrawal approval logic break? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: gte()] [DoS/Comparison Failure] Function aborts unconditionally - if greater-than-or-equal checks enforce minimum stake amounts or fee floors via gte(), will deposit validation permanently fail? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: lt()] [DoS/Comparison Failure] Function aborts unconditionally - if less-than checks validate maximum loss tolerance or ceiling caps via lt(), will risk management controls become unenforceable? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: lte()] [DoS/Comparison Failure] Function aborts unconditionally - if less-than-or-equal checks enforce upper bounds on leverage or fee caps via lte(), will protocol safety limits fail? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: sign()] [DoS/Conversion Failure] Function aborts unconditionally - if determining profit/loss direction via sign() to route positive vs negative value flows, will P&L accounting break? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: is_neg()] [DoS/Validation Failure] Function aborts unconditionally - if checking for negative values to prevent invalid states via is_neg(), will input validation on prices or amounts always abort? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: shl()] [DoS/Bitwise Failure] Function aborts unconditionally - if left-shift operations scale fixed-point values or bit manipulation for tick calculations via shl(), will precision adjustments fail? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: shr()] [DoS/Bitwise Failure] Function aborts unconditionally - if right-shift operations divide by powers of two or extract bit ranges via shr(), will efficient division or range checks become impossible? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/i32.move] [Function: or()] [DoS/Bitwise Failure] Function aborts unconditionally - if bitwise OR combines flags or masks for state encoding via or(), will packed state representations fail? (Medium)"
]