[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [Authorization Bypass] The setter function has public(package) visibility without AdminCap requirement - can any module in the switchboard package call this to replace the on_demand_package_id with a malicious package ID, breaking oracle integrity and allowing price manipulation? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [Authorization Bypass] The guardian_queue setter is public(package) without capability check - can a malicious module in the same package replace the guardian queue with an attacker-controlled queue to bypass guardian protections? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Authorization Bypass] The oracle_queue setter lacks AdminCap enforcement and is public(package) - can an attacker deploy a malicious module in the switchboard package to replace the oracle queue with a fake one returning manipulated prices? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Struct: AdminCap] [Unused Capability] AdminCap is created in init() and transferred to sender but never used in any function - does this indicate incomplete access control implementation where critical setters should require AdminCap but don't? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Privilege Escalation] AdminCap is transferred to ctx.sender() without any restrictions - if init() is called during package upgrade or by a different deployer, could an attacker gain admin privileges over the existing State object? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [Missing Access Control] There is no check that the caller owns AdminCap before allowing package ID updates - can any package module immediately after deployment call this to hijack the oracle system before legitimate setup? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [Cross-Module Attack] If a vulnerable or malicious module exists in the switchboard package with public entry functions, can an external attacker trigger that module to call set_guardian_queue_id() and corrupt the guardian queue? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Package Visibility Exploit] The public(package) visibility means any future module added to switchboard package can call this - if package upgrades add new modules with vulnerabilities, can those be exploited to manipulate oracle queue ID? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Insecure Initialization] All three IDs (oracle_queue, guardian_queue, on_demand_package_id) are initialized to zero address (0x0000...0000) - if setters are not called immediately, will oracle-dependent operations fail or accept zero address as valid, enabling DoS or bypass? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Two-Step Initialization Risk] State is shared immediately but with zero addresses - is there a window between init() and setter calls where Volo Vault could read these zero addresses and accept invalid oracle data? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [Zero Address Dereference] The getter returns state.oracle_queue which starts as zero address - if caller code assumes non-zero and dereferences this ID, will it cause runtime errors or silently accept invalid oracle state? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: guardian_queue()] [Invalid Guardian Reference] Guardian queue ID is zero by default - can this cause guardian checks to be skipped if consuming code treats zero address as 'no guardian' rather than 'invalid state'? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: on_demand_package_id()] [Package Verification Bypass] The on_demand_package_id starts as zero address - if Volo Vault uses this to verify oracle package authenticity, will zero address bypass all checks and accept any oracle data? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Race Condition] Between State object being shared and setters being called, can an attacker front-run legitimate setup by calling Volo Vault operations that read these zero addresses and exploit uninitialized state? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [No ID Validation] The setter accepts any ID without verifying it points to a valid package object - can an attacker pass a random object ID, user-owned object ID, or deleted object ID to corrupt the oracle system? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Type Safety Bypass] There is no runtime check that oracle_queue_id actually points to an oracle queue object - can an attacker pass an ID of a different object type (e.g., a Coin, NFT, or malicious struct) to cause type confusion in consuming code? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [Duplicate ID Attack] Nothing prevents setting guardian_queue to the same ID as oracle_queue - if consuming code assumes they are distinct for security separation, can this confusion enable oracle manipulation bypassing guardian checks? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [Self-Reference Vulnerability] Can the on_demand_package_id be set to point to this module's own package, creating circular reference that breaks upgrade logic or package verification in consuming modules? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Immutability Violation] The setter allows oracle_queue_id to be changed multiple times without restrictions - if Volo Vault caches this ID or makes assumptions about immutability, can repeated updates cause stale reference vulnerabilities? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [No Deletion Check] The setter doesn't verify the guardian_queue_id object still exists on-chain - can passing an ID of a deleted object cause runtime failures when Volo Vault tries to access the guardian queue? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Struct: State] [Missing Versioning] State struct has no version field - if package upgrade requires new fields or logic, can old State objects become incompatible causing oracle system failures? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [No Ownership Verification] The setter doesn't check if the package ID is owned by the expected publisher or has valid upgrade cap - can an attacker point to a package they control to inject malicious oracle logic? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Oracle Replacement Attack] An attacker with package visibility can replace oracle_queue with a malicious queue returning manipulated prices - if Volo Vault reads prices from this queue for vault value calculations, can this enable massive vault theft through artificial price inflation? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [No Staleness Check] The getter returns oracle_queue ID without any timestamp or staleness validation - if the oracle queue has been inactive or compromised, will consuming code blindly trust stale or malicious price data? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Price Manipulation Window] The oracle queue can be replaced atomically - can an attacker call this setter in the same transaction as a Volo Vault operation to manipulate prices for that specific operation then revert the queue? (Critical)"
]