[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: secp256k1_key()] [Information Disclosure] The public accessor exposes the oracle's secp256k1_key. Could this enable attackers to compute the corresponding private key through cryptanalysis or side-channel attacks? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: oracle_key()] [Key Exposure] Exposing oracle_key publicly could allow attackers to identify oracles by their keys off-chain and target specific oracles for attacks. Should this be restricted? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: expiration_time_ms()] [Time Leakage] Can exposing expiration_time_ms allow attackers to time their attacks just before oracle expiration when monitoring systems might be less vigilant? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: valid_attestation_count()] [Threshold Safety] If Volo Vault requires a minimum attestation count for price updates, could an attacker manipulate attestation counts just below the threshold to cause price update failures and block vault operations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: expiration_time_ms()] [Vault Price Staleness] If Volo Vault checks oracle expiration before accepting prices, but add_attestation doesn't update expiration_time_ms, could oracles expire mid-operation causing vault value calculation failures? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: enable_oracle()] [Price Feed Disruption] Can an attacker repeatedly call enable_oracle with short expiration times to cause frequent oracle disablement, preventing Volo Vault from obtaining price updates for critical operations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Struct: Oracle] [Queue Routing] If Volo Vault's health limiter uses queue ID to route price requests, and multiple oracles share the same queue ID, how is the correct oracle selected? Could queue collisions cause wrong price data to be used? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: N/A] [Disable Mechanism] There's no function to disable an oracle. If an oracle is compromised, how can it be deactivated to prevent further attestations or usage in Volo Vault price feeds? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: N/A] [Attestation Removal] Can individual attestations be removed if a guardian is found to be malicious? The lack of removal function means bad attestations persist until timeout expiry. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: N/A] [Emergency Pause] Is there an emergency pause mechanism to stop all attestation additions if a security issue is discovered? Lack of pause could allow exploit continuation during incident response. (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: N/A] [Oracle Deletion] Oracles are created as shared objects but there's no deletion mechanism. Can abandoned or compromised oracles accumulate, confusing dependent systems or wasting storage? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: N/A] [Attestation History] There's no mechanism to query historical attestations or track attestation changes over time. Could this hinder forensics after a security incident? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Struct: Attestation] [Signature Verification] Attestations store secp256k1_key but where is the actual signature stored and verified? If signatures aren't verified on-chain, can fake attestations be accepted? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: enable_oracle()] [Key Binding] Is there cryptographic proof that the secp256k1_key corresponds to the mr_enclave's TEE instance? Without proof, could an attacker set a key they control while claiming a legitimate mr_enclave? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: add_attestation()] [Replay Prevention] Are attestations signed with a nonce or sequence number to prevent replay? If not, could the same attestation be replayed multiple times within the timeout window? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Struct: Attestation] [Message Authentication] What message is signed by the guardian's secp256k1_key? If the signed message doesn't include oracle_id, timestamp, and data, could signatures be misused across different contexts? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: add_attestation()] [Clock Drift] If timestamp_ms comes from off-chain sources (guardians' clocks), could clock drift between guardians cause attestations to be incorrectly filtered as expired when they're actually valid? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Constant: ATTESTATION_TIMEOUT_MS] [Timeout Duration] Is 10 minutes appropriate for all oracle use cases? For high-frequency price updates in volatile markets, could attestations become stale before expiration, causing Volo Vault to use outdated prices? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: expiration_time_ms()] [Oracle Expiration] Is expiration_time_ms updated when attestations are added, or does it remain at the enable_oracle value? If static, could oracles expire despite having fresh attestations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Struct: Oracle] [State Transitions] What are the valid state transitions for an oracle? Can it go from enabled → disabled → enabled? Are state invariants maintained across transitions? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: new()] [Initialization] After new(), the oracle has empty secp256k1_key and mr_enclave. Can operations be performed on an uninitialized oracle before enable_oracle is called? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: enable_oracle()] [Re-enablement] If an oracle expires, can enable_oracle be called again with new parameters? Should previous attestations be cleared upon re-enablement? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: add_attestation()] [Empty Attestations] If all attestations are filtered out (expired or same guardian), the vector becomes empty. Can an oracle with zero attestations be used, and if so, what's the security impact? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: valid_attestation_count()] [Zero Count] If valid_attestation_count returns 0, should dependent systems reject the oracle? Is there validation to ensure a minimum attestation count for critical operations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/schemas/oracle.move] [Function: add_attestation()] [Single Guardian] If only one guardian exists, and a new attestation from that guardian is added, does the old attestation get filtered and replaced? Could this create a vulnerability where guardian attestations can be repeatedly updated? (Medium)"
]