[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: to_target_decimal_value()] [Multiplication Order] Does multiplying value by 10 before incrementing decimal cause different overflow behavior than pre-incrementing, and can attackers exploit this ordering to cause overflows at specific value thresholds? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: to_target_decimal_value()] [Division Remainder Loss] When dividing value by 10, the remainder is permanently lost, can an attacker repeatedly convert prices through this function to systematically extract value through accumulated remainder losses? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: to_target_decimal_value()] [No Revert Data] When assertion fails, there's no descriptive error message, making it difficult to diagnose which oracle price feed failed, can this delay detection of systematic attacks on price conversion logic? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: to_target_decimal_value()] [Same Decimal Optimization] If decimal equals target_decimal, the function still enters the while loop check, can an attacker exploit this to waste gas on no-op conversions when processing large batches of oracle prices? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: to_target_decimal_value()] [Recursive Conversion Attack] If vault code calls this function multiple times in sequence (e.g., 18→9→6), can compounded precision loss exceed tolerable bounds, enabling an attacker to profit from price discrepancies between conversion paths? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Zero Division Bypass] When a=0 or b=0, the function returns U64MAX without calculating amplitude, can an attacker manipulate oracle prices to be zero temporarily to bypass amplitude checks meant to detect price manipulation? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Max Address Overflow Check] The overflow check uses sui::address::max() / constants::multiple(), but address::max() is u256 while multiple() returns u64, can the division result be incorrect due to type mismatch, allowing overflows to pass through? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [U64MAX Saturation Attack] When amplitude calculation would exceed U64MAX, the function returns U64MAX, can an attacker deliberately trigger extreme price differences to always get U64MAX returned, breaking amplitude-based circuit breakers in vault operations? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Division by A Manipulation] The formula divides by 'a' without checking if a is very small (but non-zero), can an attacker set a=1 to amplify amplitude values by millions, triggering false positive alerts in price deviation monitoring? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Multiple Constant Dependency] The function multiplies by constants::multiple() which returns 10000, but is this constant validated elsewhere, can changing it break amplitude calculations across all oracle integrations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Precision Loss in Amplitude] When calculating amplitude for very small differences (e.g., a=1000000000000, b=1000000000001), can integer division cause amplitude to round down to 0, hiding legitimate price deviations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Overflow Detection Gap] The check ab_diff > address::max() / multiple() may not catch all overflows, can ab_diff be just under the threshold but ab_diff * multiple() still overflow during multiplication? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Type Cast Truncation] When casting final amplitude from u256 to u64, if amplitude is between U64MAX and u256::MAX, does the function correctly return U64MAX or could truncation cause it to wrap to a small value? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Asymmetric Amplitude] The function calls abs_sub() which makes calculation symmetric, but should amplitude be calculated differently when a > b versus b > a for detecting price increases vs decreases? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Zero Check Ordering] The function checks 'a == 0 || b == 0' before calculating ab_diff, but what if both prices are zero simultaneously in an oracle outage, does returning U64MAX correctly signal this critical failure state? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Multiple Basis Points] With multiple=10000 (basis points), amplitude of 10000 means 100% difference, but can rounding cause amplitude=9999 to pass checks meant to block 100% deviations, enabling price manipulation attacks? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Denominator Selection] Amplitude divides by 'a' not by average(a,b) or max(a,b), can an attacker manipulate which price becomes 'a' to inflate or deflate amplitude calculations, bypassing deviation thresholds? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Gas Optimization Attack] The function performs multiple expensive operations (abs_sub, division, comparisons), can an attacker force many amplitude calculations in a single transaction to exhaust gas during critical vault operations? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Oracle Stale Price] If 'a' is a stale price and 'b' is fresh, amplitude may be high even though only one price is wrong, can this cause legitimate price updates to be rejected, DoSing vault operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Percentage Interpretation] With multiple=10000, an amplitude of 20000 means 200% difference (price tripled), but is this consistently interpreted across all vault contracts using this function, or can inconsistent interpretation enable exploits? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: calculate_amplitude()] [Early Return Optimization] When a or b is zero, returning U64MAX immediately saves gas but prevents logging which price was zero, can this hide systematic attacks that manipulate prices to zero? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: abs_sub()] [Overflow in Subtraction] Even though function returns absolute value, if a and b are both close to u256::MAX, can intermediate calculations overflow before the comparison completes? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: abs_sub()] [Equal Values Edge Case] When a equals b exactly, the function returns 0, can an attacker exploit this by manipulating oracle prices to be exactly equal, causing amplitude checks to pass when they should detect manipulation? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: abs_sub()] [Underflow Protection] Move prevents underflow in subtraction, but can an attacker exploit the ordering by passing values that cause different execution paths to have different gas costs, enabling timing attacks on oracle updates? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/oracle_utils.move] [Function: abs_sub()] [Branch Prediction] The if/else branches execute different subtractions, can an attacker repeatedly alternate between a>b and a<b states to cause branch mispredictions and degrade oracle update performance? (Low)"
]