[
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Authorization Bypass] Can an attacker bypass AdminCap check by exploiting type confusion or capability forging to call set_enabled and disable vault during active operations, locking user funds? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [State Corruption] If vault is enabled/disabled during VAULT_DURING_OPERATION_STATUS, can this create inconsistent state where operations are partially complete but vault status prevents recovery actions? (High)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Race Condition] Can an admin disable vault immediately after a user submits a deposit request but before execution, causing funds to be stuck in request buffer indefinitely? (High)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [DoS Attack] Can repeated enable/disable calls within same transaction or across transactions cause event spam or state thrashing that prevents legitimate operations? (Medium)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Access Control] Does set_vault_enabled properly validate that the vault is not during operation before changing status, preventing status corruption during active DeFi operations? (High)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Invariant Violation] If vault is disabled while holding borrowed DeFi assets (Navi caps, Cetus positions), can this prevent proper asset return and cause permanent custody issues? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Timing Attack] Can attacker front-run admin disable transaction to execute malicious operations knowing vault will be frozen immediately after? (Medium)",
  "[File: volo-vault/sources/manage.move] [Function: set_vault_enabled()] [Parameter Validation] Does the function validate that enabled bool value transitions are logical (e.g., not setting enabled=true when already true) to prevent unnecessary state changes? (Low)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [Version Manipulation] Can an attacker exploit upgrade_vault to bypass version checks if VERSION constant is manipulated or if upgrade logic doesn't properly validate version increments? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [State Migration] Does upgrade_vault properly handle migration of all vault state including request_buffer, assets, receipts, and op_value_update_record, or can incomplete migration leave vault in corrupted state? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [Reentrancy] Can upgrade_vault be called multiple times in nested context to skip version validation and corrupt vault version tracking? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [Timing Exploit] If upgrade_vault is called while vault has pending deposits/withdrawals or active operations, can this cause request buffer corruption or loss of user funds? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [Access Control] Does unused_variable attribute on AdminCap parameter create vulnerability where function could be exploited without proper authorization? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [Invariant Break] Can upgrade_vault be exploited to reset critical vault parameters like total_shares, loss_tolerance, or fee rates to default values, causing accounting errors? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_vault()] [DoS] Can repeated upgrade_vault calls cause event emission spam or table/bag corruption that prevents normal vault operations? (Medium)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_reward_manager()] [Version Desync] Can upgrade_reward_manager be called without upgrading vault, causing version mismatch between vault and reward manager that breaks reward distribution logic? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_reward_manager()] [State Corruption] If reward manager is upgraded while rewards are being distributed or receipt updates are pending, can this cause loss of accrued rewards or incorrect share calculations? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_reward_manager()] [Authorization] Does function verify reward_manager address matches vault.reward_manager before allowing upgrade, or can arbitrary reward manager be upgraded? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_reward_manager()] [Reentrancy] Can upgrade_reward_manager be exploited in nested calls to corrupt reward accounting or bypass version checks? (Medium)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_reward_manager()] [Integration Risk] Does upgrade_reward_manager properly handle migration of reward buffers, receipt reward tracking, and vault ID associations? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_oracle_config()] [Price Manipulation] Can upgrade_oracle_config be exploited during active operations to change oracle version and cause stale price acceptance or incorrect USD valuations? (Critical)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_oracle_config()] [Timing Attack] If oracle config is upgraded while vault is calculating total_usd_value for deposit/withdraw execution, can this cause price inconsistencies and slippage violations? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_oracle_config()] [State Migration] Does oracle upgrade properly migrate all Switchboard aggregator mappings, decimals settings, and update interval configurations without loss? (High)",
  "[File: volo-vault/sources/manage.move] [Function: upgrade_oracle_config()] [DoS] Can upgrade_oracle_config be called repeatedly to cause version/aggregator map corruption that prevents price updates? (Medium)",
  "[File: volo-vault/sources/manage.move] [Function: set_deposit_fee()] [Fee Extraction] Can admin set deposit_fee to MAX_DEPOSIT_FEE_RATE (500bp = 5%) immediately before large user deposit to extract maximum fees, violating user expectations? (High)"
]