[
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [Reference Invalidation] After deletion, if lending module still holds references to this AccountCap's UID or owner, do those references become dangling pointers causing undefined behavior? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [Deletion Timing] Function is public(friend) but no time-lock or cooldown - can an attacker delete AccountCap immediately after taking maximum borrow to avoid liquidation in next epoch? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [UID Reuse] After object::delete(id), could the UID be recycled for a new AccountCap? If so, could new cap with recycled UID access old cap's lending positions due to UID-based lookups? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [Owner Field Ignored] Function ignores owner field with underscore - if owner validation is needed for deletion (e.g., only owner can delete), this bypass allows anyone with friend access to delete any AccountCap? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [Storage Cleanup] Only deletes UID but doesn't clean up any associated storage in lending module - can this cause storage leaks where deleted AccountCaps' data persists causing accounting errors? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: delete_account_cap()] [Reentrancy] If deletion triggers any callbacks or events in lending module, could an attacker exploit reentrancy to delete cap mid-operation, breaking lending operation invariants? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: account_owner()] [Public Access] Function is fully public with no access control - can an attacker use this to enumerate all AccountCap owners and target specific accounts for exploits or phishing attacks? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: account_owner()] [Ownership Validation] Returns owner field without validating it matches UID address - if owner field was somehow corrupted, does this propagate incorrect owner info to lending module causing authorization bypass? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: account_owner()] [Reference-Based] Takes immutable reference - if cap is being mutated elsewhere, could this return stale owner data causing race condition in lending operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Function: account_owner()] [Privacy Leak] Public function exposes owner addresses - can this be used to correlate lending positions across multiple AccountCaps and identify whale accounts for targeted attacks? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Friend: lending_core::lending] [Friend Module Vulnerability] Only lending_core::lending is friend - if lending module has any public entry functions that internally call account functions, can an attacker exploit this to bypass friend restrictions? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Friend: lending_core::lending] [Module Upgrade] If lending_core::lending is upgraded to malicious version, can new code abuse friend access to create/delete AccountCaps arbitrarily breaking all lending positions? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Friend: lending_core::lending] [Friend List Extension] Only one friend module - if protocol needs to add more friends later, could this require migration breaking all existing AccountCaps? (Low)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Friend: lending_core::lending] [Transitive Trust] Friend module might call other modules - can an attacker exploit transitive calls to indirectly trigger account functions bypassing friend restrictions? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Module Integration] [Lending Position Mismatch] Account module has no knowledge of lending positions - can an attacker create AccountCap without corresponding lending position, or vice versa, causing sync issues? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Module Integration] [UID as Key] If lending module uses AccountCap UID as key for positions, what happens if two caps have same UID? Could this cause position collision or double-spend? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Module Integration] [Owner as Key] If lending module uses owner address as key, can multiple AccountCaps with same owner cause position merging or incorrect accounting? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Module Integration] [Cap Lifetime] No lifecycle hooks - if lending module expects caps to be persistent, can premature deletion break position tracking? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Module Integration] [Transfer Notification] AccountCap transfer via 'store' ability doesn't notify lending module - if cap is transferred to new owner, does lending position stay with old owner causing custody mismatch? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Ownership Model] [UID-Owner Mismatch] Owner derived from UID at creation but stored separately - can these diverge? If UID changes but owner doesn't, which is authoritative for lending operations? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Ownership Model] [Immutable Owner] Owner field can never change after creation - if user loses AccountCap or it's stolen, can they create new cap with same owner? Would this cause position confusion? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Ownership Model] [Parent-Child Ownership] Parent and all children have same owner - can an attacker exploit this to bypass per-address lending limits by creating child caps? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [Ownership Model] [Zero Address] No validation that owner is non-zero - could AccountCap be created with address(0) owner bypassing all ownership checks? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [State Management] [No State Tracking] Module has no global state tracking AccountCaps - can this cause orphaned caps that exist but aren't tracked, breaking protocol invariants? (High)",
  "[File: volo-vault/local_dependencies/protocol/lending_core/sources/account.move] [State Management] [Cap Registry] No registry of created caps - can an attacker create unlimited caps without detection, bypassing protocol limits? (Medium)"
]