[
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Atomicity Risk] Request creation returns struct value, not reference - between new() and table insertion, can transactions abort leaving receipts in pending state without corresponding requests? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Request ID] request_id is self-incremented but validation is in vault - if withdraw_id_count overflows u64 after 2^64 requests, can new request IDs collide with old ones still in the table? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [ID Correlation] No cryptographic binding between (request_id, receipt_id) pair - can attackers craft requests with mismatched IDs if validation in request_withdraw() is bypassed? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Time Manipulation] request_time uses clock.timestamp_ms() but no block height - can validators manipulate timestamp to bypass locking_time_for_cancel_request checks in cancel_withdraw()? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: request_time()] [Timing Attack] Public getter exposes exact creation time - can MEV bots calculate when locking_time_for_cancel_request expires to front-run cancellations? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Math Invariant] No validation that expected_amount matches shares at creation - if user sets expected_amount far below fair value, can they be griefed by operators who execute immediately, giving them much less than shares are worth? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Ratio Drift] Request stores snapshot expected_amount but shares are withdrawn at future ratio - if share_ratio decreases significantly between request and execution, can users receive expected_amount even though their shares are worth much less, draining vault? (Critical)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: shares()] [Zero Shares] No validation prevents shares=0 requests - can zero-share requests be executed to trigger fee calculations, events, or state changes that shouldn't occur? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Receipt Mismatch] receipt_id is address type without type-safety - can receipt IDs from other vaults or contracts be used, breaking the invariant that requests belong to specific receipts? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Vault Mismatch] vault_id is not validated against actual vault - can requests be created with wrong vault_id, causing confusion in multi-vault deployments or enabling cross-vault attacks? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: vault_id()] [ID Verification] Getter provides vault_id but no function validates it matches - if execute_withdraw() doesn't check vault_id, can requests for other vaults be executed? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Zero Address] recipient can be address::from_u256(0) for manual claim - can this special case be exploited if execute_withdraw() logic incorrectly handles zero address, sending funds to burn address? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: recipient()] [Recipient Change] Recipient is immutable after request creation - if receipt ownership transfers after request creation but before execution, can original recipient still claim funds meant for new owner? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Recipient Validation] No check that recipient matches receipt owner at creation - can users create requests sending their shares to arbitrary addresses, bypassing receipt transfer restrictions? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Immutability] All fields are immutable after creation - if vault parameters change (fees, ratios, locking_time), can old requests be executed under outdated assumptions? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Missing Metadata] No version or upgrade field - if WithdrawRequest struct is upgraded, can old requests in the table be misinterpreted? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [No Nonce] No replay protection nonce - if requests are copied, can duplicate requests exist for the same receipt/shares? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Slippage Gaming] expected_amount is set at request time but execution can be delayed - can users set expected_amount based on current ratio, then operators delay execution until ratio improves, giving users more than they locked in? (Medium)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Share Price Manipulation] Request locks shares amount but not USD value - can attackers create requests, manipulate share price downward through operations, then execute at lower price to extract more principal? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: expected_amount()] [Fee Bypass] expected_amount represents user expectation before fees - if execute_withdraw() applies fees after slippage check, can users receive less than expected_amount after fees, breaking slippage protection? (High)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [Table Growth] No maximum requests per receipt - can users spam withdraw requests to fill the table, causing DoS via storage costs or iteration limits? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Function: new()] [Resource Exhaustion] No rate limiting on request creation - can attackers create many requests with tiny shares to exhaust request_id space or operator execution capacity? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [No Emergency Stop] No emergency cancel flag - if a request is created with malicious parameters, can it be stopped before execution? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [No Partial Execution] shares is single value - can large withdrawals cause liquidity issues if they can't be partially executed? (Low)",
  "[File: volo-vault/sources/requests/withdraw_request.move] [Struct: WithdrawRequest] [No Priority Queue] request_id is simple counter - can high-priority withdrawals (e.g., liquidations) be delayed behind spam requests? (Low)"
]