[
  "[File: volo-vault/local_dependencies/mmt_v3/sources/utils/bit_math.move] [Function: least_significant_bit()] [Denial of Service] If any Volo component depends on least_significant_bit() for price calculations, liquidity math, or fee computations, the unconditional abort 0 will cause all dependent operations to fail, leading to complete protocol DoS. What upstream modules call this function and what is the blast radius? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/utils/bit_math.move] [Function: most_significant_bit()] [Denial of Service] If any Volo component depends on most_significant_bit() for range checks, decimal conversions, or oracle price normalization, the unconditional abort 0 will cause all dependent operations to fail. What is the dependency chain? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/utils/bit_math.move] [Module: bit_math] [Integration Risk] The mmt_v3 module is listed as a local dependency for AMM math. If vault operations, adaptors (Cetus CLMM), or oracle price calculations rely on bit manipulation utilities that are unimplemented, the protocol cannot function. Has the protocol been tested end-to-end with these stubs? (Critical)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/utils/bit_math.move] [Function: least_significant_bit()] [Implementation Gap] The function signature suggests it should return the position of the least significant bit in a u256 value, commonly used for logarithmic calculations in AMM pricing. Without implementation, any AMM integration relying on this will fail. What is the intended implementation and why is it missing? (High)",
  "[File: volo-vault/local_dependencies/mmt_v3/sources/utils/bit_math.move] [Function: most_significant_bit()] [Implementation Gap] The function signature suggests it should return the position of the most significant bit in a u256 value, commonly used for square root approximations and range finding in DeFi math. Without implementation, dependent calculations cannot execute. What are the downstream effects? (High)"
]