[
  "[File: liquid_staking/sources/cert.move] [Constant: DECIMALS] [Precision Loss] DECIMALS is set to 9 (1e9 precision). When interacting with protocols using different decimals (e.g., USDC=6, or 1e18 precision tokens), could decimal conversions cause rounding errors that accumulate to significant value loss? (High)",
  "[File: liquid_staking/sources/cert.move] [Constant: VERSION] [Upgrade Path] VERSION is hardcoded to 1. If a future upgrade needs to version backwards for rollback, does the migration logic support downgrading, or would this break assert_version() checks? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Constant: DECIMALS] [Ratio Calculations] In downstream stake_pool calculations using get_total_supply_value(), could the fixed 9 decimals cause precision loss when computing share ratios, especially with large SUI amounts (which also use 9 decimals)? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Function: get_total_supply()] [Reference Exposure] get_total_supply() returns a reference to Supply<CERT>. Could external code use this reference to read supply in a transaction before mint/burn completes, getting stale values that enable arbitrage? (Low)",
  "[File: liquid_staking/sources/cert.move] [Function: get_total_supply_value()] [Race Condition] If get_total_supply_value() is called in the same transaction where mint() or burn() is occurring, could the value be inconsistent with the actual coin distribution, enabling MEV attacks? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Function: get_total_supply_value()] [View Function] As a public read function, get_total_supply_value() could be called by untrusted contracts. Could malicious contracts use this in loops to DoS the chain or perform expensive computations? (Low)",
  "[File: liquid_staking/sources/cert.move] [Package Visibility] [Module Trust] public(package) functions trust all modules in liquid_staking package. If a less-audited module like volo_v1 migration logic exists, could it abuse mint/burn to manipulate supply? (High)",
  "[File: liquid_staking/sources/cert.move] [Import: ownership::OwnerCap] [Capability Leak] migrate() accepts &OwnerCap. If OwnerCap is clonable or transferable, could multiple parties claim ownership and trigger concurrent migrations, causing version confusion? (High)",
  "[File: liquid_staking/sources/cert.move] [Friend Declaration] [Commented Code] The friend declaration for native_pool is commented out. If this was uncommented without proper auditing, could native_pool gain access to package functions and abuse mint/burn? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Event: MigratedEvent] [Information Leak] MigratedEvent exposes prev_version and new_version publicly. Could attackers monitor for migration events to front-run operations during vulnerable migration windows? (Low)",
  "[File: liquid_staking/sources/cert.move] [Event: MigratedEvent] [Missing Events] There are no events for mint() and burn() operations. Does this make it difficult to track supply changes off-chain, potentially hiding exploits until significant damage occurs? (Low)",
  "[File: liquid_staking/sources/cert.move] [Struct: CERT] [Phantom Type] CERT has drop ability. Could this enable type confusion where CERT is dropped in unexpected contexts, bypassing coin accounting safeguards? (Low)",
  "[File: liquid_staking/sources/cert.move] [Struct: Metadata] [Generic Parameter] Metadata<T> uses phantom type parameter T. Could instantiating Metadata<OtherType> create parallel supply tracking that bypasses CERT supply limits? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Struct: Metadata] [Key+Store Abilities] Metadata has both key and store abilities. Could Metadata be transferred/wrapped in ways that break singleton assumptions, creating multiple supply trackers? (High)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Flash Mint Attack] [Supply Inflation] Could an attacker call mint() from a compromised package module, mint massive CERT amounts, swap for SUI in DEX pools, then cover tracks by burning in same transaction before supply checks? (Critical)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Burn Front-Running] [Accounting Exploit] If user calls unstake requiring burn_coin(), could attacker front-run with their own burn to decrease total supply, increasing share price and causing user's burn to claim more SUI than entitled? (High)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Mint/Burn Sandwich] [MEV Exploit] Could MEV bot sandwich stake() calls by: 1) burning CERT to inflate share price, 2) user mints at bad rate, 3) bot mints back CERT at profit? (High)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Supply Query Manipulation] [Oracle Attack] If external contracts query get_total_supply_value() for pricing, could attacker manipulate supply via mint/burn right before queries to skew CERT/SUI exchange rates? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Migration Race] [State Corruption] Could two migration transactions be submitted simultaneously, both passing version < VERSION check, but executing in sequence causing double version increment or corrupted state? (High)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Partial Migration] [DoS Attack] If migrate() partially succeeds (version updated) but subsequent state setup fails, could the protocol be stuck in an invalid state where neither old nor new version logic works? (High)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Version Downgrade] [Rollback Attack] If a critical bug is found and VERSION needs to be decreased for rollback, would assert_version() block all operations, requiring emergency pause/upgrade paths that may not exist? (Medium)",
  "[File: liquid_staking/sources/cert.move] [Scenario: Package Module Compromise] [Privilege Escalation] If any module in liquid_staking package (stake_pool, manage, validator_pool, etc.) has exploitable logic, could attacker leverage package visibility to mint unlimited CERT tokens? (Critical)",
  "[File: liquid_staking/sources/cert.move] [Scenario: OwnerCap Theft] [Admin Takeover] If OwnerCap is stolen or leaked (stored in compromised wallet, exploitable admin contract), could attacker call migrate() to malicious VERSION, breaking all cert operations? (Critical)",
  "[File: liquid_staking/sources/cert.move] [Integration: Stake Pool] [Ratio Calculation] When stake_pool calculates SUI/CERT ratio using get_total_supply_value(), could race conditions between ratio read and mint/burn execution cause arbitrage opportunities? (High)",
  "[File: liquid_staking/sources/cert.move] [Integration: DEX Pools] [Price Manipulation] If CERT is tradeable in DEX pools, could attacker manipulate total_supply via package module exploits to create artificial price pumps, rug-pulling liquidity providers? (High)"
]