[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Race Condition on State] The actuate() function modifies the shared State object without any locking mechanism. Can multiple concurrent calls to run() create race conditions where the final oracle_queue value is unpredictable, or events are emitted out of order? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Event Ordering Attack] The actuate() function emits OracleQueueIdSet event after state modification. Can an attacker front-run the event emission in transaction ordering, creating scenarios where off-chain listeners observe events that don't match on-chain state? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Missing Rollback Logic] The actuate() function has no rollback mechanism if the state change causes downstream failures. If setting a new oracle_queue_id breaks all vault operations, can the system be permanently bricked with no way to revert to the previous working queue? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [State Corruption via Reentrancy] The actuate() function calls on_demand::set_oracle_queue_id() which modifies state. Can a malicious oracle queue implementation trigger reentrancy during this call, allowing manipulation of other State fields (guardian_queue, on_demand_package_id) in an atomic transaction? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Event Data Integrity] The actuate() function reads state.oracle_queue() before the state change to emit old_oracle_queue_id. Can this create a time-of-check-time-of-use vulnerability where the old value is read, state is modified elsewhere, then the event contains incorrect historical data? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Event Spamming] The actuate() function emits an event on every call with no deduplication. Can an attacker with AdminCap spam identical oracle queue changes, flooding event logs and causing DoS for off-chain indexers monitoring these events? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Missing Event Validation] The actuate() function emits OracleQueueIdSet with both old and new IDs but does not validate that they are different. Can an attacker set the same queue ID repeatedly, creating misleading event logs that hide actual oracle changes? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: actuate()] [Event Listener Desync] The actuate() function emits events that off-chain systems rely on to track oracle changes. Can rapid oracle queue changes cause event processing delays or missed events, leading to off-chain systems using stale oracle information? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Volo Vault Price Impact] The run() function changes the oracle queue that Volo vault depends on for asset pricing. Can an attacker switch to a queue with different price feeds mid-operation, causing vault operations to use inconsistent prices (e.g., deposit at low price, withdraw at high price)? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Health Limiter Bypass] The run() function changes the oracle source that health_limiter uses to check Navi health factors. Can an attacker switch to a malicious oracle returning inflated collateral prices, bypassing health checks and enabling unsafe borrows that exceed safety limits? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Adaptor Price Inconsistency] The run() function affects prices used by all vault adaptors (Navi, Suilend, Cetus, Momentum). Can switching oracle queues mid-transaction cause adaptors to use different price sources, enabling arbitrage where assets are valued differently across protocols? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Liquidation Cascade] The run() function can suddenly change asset valuations used for liquidation decisions. Can an attacker switch to an oracle queue with dramatically different prices, triggering mass liquidations in Volo vault or preventing legitimate liquidations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Share Price Manipulation] The run() function affects oracle prices used in vault share calculations. Can switching oracle queues cause sudden share price changes, enabling an attacker to deposit before a price increase or withdraw before a price decrease? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Fee Calculation Error] The run() function changes price feeds used to calculate vault fees in USD terms. Can oracle queue manipulation cause fee miscalculations, allowing an attacker to underpay fees or causing the protocol to overcharge users? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Loss Tolerance Bypass] The run() function affects the total_usd_value calculations used to enforce loss_tolerance limits. Can switching to a manipulated oracle queue allow operations that should be blocked by loss tolerance checks to proceed? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Decimal Conversion Exploit] The run() function changes the oracle source which may use different decimal precision (1e9 vs 1e18). Can switching between oracle queues with different decimal standards cause overflow/underflow in price conversions, leading to incorrect asset valuations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Front-Running Price Change] The run() function is a public entry function that anyone can observe in mempool. Can an attacker front-run an oracle queue change by submitting vault operations that benefit from the old oracle prices before the change takes effect? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Sandwich Attack on Oracle Change] The run() function changes oracle queues without any delay or announcement. Can an attacker sandwich the oracle change transaction (action before and after) to profit from price discrepancies between old and new oracle feeds? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Back-Running Exploit] The run() function immediately makes the new oracle queue active. Can an attacker back-run the oracle change, submitting transactions immediately after that exploit temporary price inconsistencies before the new oracle stabilizes? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [MEV Extraction] The run() function creates a known state transition that MEV bots can exploit. Can an attacker coordinate oracle queue changes with vault operations to extract maximum value through optimal transaction ordering? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [No Timelock Protection] The run() function executes immediately with no timelock or delay. Can a compromised admin perform a flash attack, changing the oracle queue, executing malicious transactions, and changing it back in a single block before detection? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Oracle Fee Manipulation] The run() function may switch to oracle queues with different fee structures. Can an attacker repeatedly switch to cheaper oracle queues to reduce costs or force users to pay higher oracle fees through expensive queue selections? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Oracle Security Trade-off] The run() function allows switching between oracle queues with different security guarantees (number of oracles, reputation). Can cost-cutting admins switch to cheaper but less secure oracles, increasing price manipulation risk? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: run()] [Collusion Attack] The run() function centralizes oracle selection in AdminCap holder. Can a colluding admin and oracle operator coordinate queue changes and price manipulations to extract value from Volo vault users? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_oracle_queue_id_action.move] [Function: validate()] [No Queue Compatibility Check] The validate() function does not verify that the new oracle queue supports all the price feeds required by Volo vault. Can switching to an incomplete oracle queue cause missing price data for some vault assets, DoSing operations involving those assets? (High)"
]