[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [Guardian Bypass] If guardian queue is supposed to validate oracle data, can replacing it with a permissive or attacker-controlled guardian allow injection of manipulated prices that would normally be rejected? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: on_demand_package_id()] [Package Source Verification] If Volo Vault uses this ID to verify oracle data comes from legitimate Switchboard package, can an attacker replace it mid-operation to accept prices from a malicious source? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Cross-Queue Attack] Can an attacker set oracle_queue_id to point to a queue from a different oracle network (e.g., testnet, deprecated version) with different security properties to bypass price validation? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [No Aggregator Verification] The module only stores queue ID, not aggregator addresses - can an attacker create a malicious aggregator in the legitimate queue but this module can't distinguish it from trusted aggregators? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Shared Object Race] State is shared via transfer::share_object() making it accessible to all - can multiple transactions simultaneously call setters causing race conditions where oracle/guardian queue IDs are set to inconsistent values? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Concurrent Modification] Since State is shared, multiple modules can call setter simultaneously - if Volo Vault reads oracle_queue in one tx while another tx updates it, can this cause TOCTOU (time-of-check-time-of-use) vulnerabilities in price reads? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [State Inconsistency] No atomic update mechanism for all three IDs - can interleaved setter calls from different modules create inconsistent state where oracle/guardian/package IDs don't match expected configuration? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Struct: State] [No Mutation Lock] State is freely mutable by any package module without locks or versioning - can concurrent setters create race conditions where Volo Vault reads partially updated state (e.g., new oracle queue with old package ID)? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [Read-After-Write Race] If one tx reads oracle_queue while concurrent tx updates it via setter, will the read see old or new value, and can this timing be exploited to use stale oracle references? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [No Event Emission] The setter updates critical package ID but emits no event - can an attacker silently replace the package ID without detection, preventing incident response or fraud analysis? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Silent Oracle Replacement] Oracle queue can be changed without any on-chain event - if monitoring systems rely on events to detect oracle manipulation, can this enable undetected attacks on Volo Vault price feeds? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [No Audit Trail] Guardian queue updates have no event logs - can an attacker replace the guardian then revert it after exploit, leaving no evidence of the attack for forensic analysis? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Missing Initialization Event] No event is emitted when State is created - can this make it difficult to track which State object is canonical if multiple are accidentally created? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [Multiple Initialization Risk] If package is upgraded and init() runs again, will a second State object be created, and can this cause confusion where some modules use old State and others use new State? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: init()] [AdminCap Duplication] Package upgrade causing re-init could create a second AdminCap - can this break single-admin assumption and enable unauthorized access if both caps are considered valid? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Struct: State] [Upgrade Incompatibility] If package upgrade adds new fields to State, existing shared State objects won't have them - can this cause runtime errors or security bypasses when upgraded code accesses missing fields? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_on_demand_package_id()] [Upgrade Loop] Can this setter be used to create circular package dependencies where on_demand_package_id points to a newer version that points back, breaking upgrade verification? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Struct: AdminCap] [No Cap Migration] If AdminCap holder loses access or cap is burned, there's no recovery mechanism - can this permanently brick the oracle configuration if legitimate admin loses AdminCap? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [Unchecked Dereference] If Volo Vault calls this getter then tries to borrow the returned ID as an object without existence check, can it crash or panic if ID is invalid/deleted? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: guardian_queue()] [Guardian Assumption Violation] If consuming code assumes guardian queue is always initialized and active, can returning zero or invalid ID cause guardian verification logic to fail open and accept unvalidated oracle data? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: on_demand_package_id()] [Package Trust Violation] If Volo Vault uses this to whitelist trusted oracle packages, can changing this ID mid-operation cause vault to accept oracle data from untrusted packages? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Volo Vault Cache Invalidation] If Volo Vault caches oracle queue reference for gas optimization, can updating the queue ID in State cause vault to use stale cached reference with wrong oracle? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: oracle_queue()] [Cross-Module Type Confusion] If different package modules expect oracle_queue to have different types (e.g., one expects OracleQueue<X>, another expects OracleQueue<Y>), can ID reuse across types cause runtime type errors? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_oracle_queue_id()] [Oracle DoS] Can an attacker repeatedly update oracle_queue_id in every block to cause Volo Vault oracle reads to fail due to constant reference changes? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/on_demand.move] [Function: set_guardian_queue_id()] [Guardian Queue Deletion] Can setting guardian_queue to an ID that will be deleted immediately after cause all guardian-protected operations to fail with object-not-found errors? (Medium)"
]