[
  "[File: volo-vault/sources/oracle.move] [Function: get_normalized_asset_price()] [Inconsistent Precision] Normalization to 9 decimals may not match vault's internal precision expectations - can this mismatch cause value calculation errors? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: coin_decimals()] [Unchecked Access] Directly accesses aggregators[asset_type].decimals without checking existence - can this panic if called for removed aggregators? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Duplicate Prevention] The function checks !config.aggregators.contains(asset_type) but doesn't prevent adding the same aggregator address for different asset types - can this cause confusion? (Low)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Price Initialization] Calls get_current_price() for init_price which has its own staleness check - can an attacker add an aggregator with stale initial price if timing is manipulated? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Missing Validation] No validation that decimals is within reasonable bounds (0-18) - can extreme decimals cause normalization issues? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Aggregator Verification] The function doesn't verify that the aggregator address is valid or that it actually exists - can adding a fake aggregator address cause future operations to fail? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Asset Type Collision] No validation of asset_type format or collision with existing types - can an attacker add malicious asset types that conflict with legitimate ones? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Clock Manipulation] Uses clock.timestamp_ms() for last_updated without validation - can clock manipulation allow backdated price entries? (Low)",
  "[File: volo-vault/sources/oracle.move] [Function: add_switchboard_aggregator()] [Event Emission Only] Only emits event but doesn't verify the operation succeeded - can failed additions appear successful in event logs? (Low)",
  "[File: volo-vault/sources/oracle.move] [Function: remove_switchboard_aggregator()] [Active Usage Check] Doesn't verify if the aggregator is currently in use by vault operations - can removing an active aggregator cause vault operations to fail mid-transaction? (Critical)",
  "[File: volo-vault/sources/oracle.move] [Function: remove_switchboard_aggregator()] [Price Persistence] After removal, can cached prices in vault logic still reference the removed aggregator, causing inconsistencies? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: remove_switchboard_aggregator()] [Event Timing] Emits event before actual removal - if removal fails, will the event mislead external observers? (Low)",
  "[File: volo-vault/sources/oracle.move] [Function: remove_switchboard_aggregator()] [Reentrancy] Can an attacker call remove during an active price update, causing the update to reference a partially-removed aggregator? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: remove_switchboard_aggregator()] [Missing Cleanup] Removes aggregator but doesn't clean up any references in other parts of the vault - can this cause dangling references? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Price Discontinuity] Changes aggregator and immediately sets new price from get_current_price() - can this cause dramatic price jumps that violate vault's price movement limits? (Critical)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Atomic Operation] If get_current_price() fails, the aggregator address is already changed - can this leave the oracle in an inconsistent state? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Event Order] Emits event with old_aggregator before price_info is fully updated - can this create race conditions in event processing? (Low)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Decimal Mismatch] Doesn't verify that the new aggregator has the same decimals as the old one - can changing to an aggregator with different decimals cause value calculation errors? (Critical)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Price Manipulation] An operator can change to a malicious aggregator with manipulated prices - what prevents this attack vector? (Critical)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Active Operations] Doesn't check if vault operations are in progress - can changing aggregators mid-operation cause value calculation inconsistencies? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: change_switchboard_aggregator()] [Staleness Reset] Sets last_updated to current timestamp, effectively resetting staleness tracking - can this be abused to make old prices appear fresh? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: update_price()] [Public Access] Function is public, allowing anyone to update prices - can an attacker spam price updates to manipulate vault operations or DoS the system? (Medium)",
  "[File: volo-vault/sources/oracle.move] [Function: update_price()] [Aggregator Verification] Checks price_info.aggregator == aggregator.id().to_address() but doesn't verify the aggregator object is valid - can a malicious aggregator object be passed? (High)",
  "[File: volo-vault/sources/oracle.move] [Function: update_price()] [Price Source Trust] Fully trusts get_current_price() result without additional validation - can compromised Switchboard aggregators inject malicious prices? (Critical)",
  "[File: volo-vault/sources/oracle.move] [Function: update_price()] [Race Condition] Between get_current_price() and updating price_info, can another transaction change the aggregator, causing mismatch? (Medium)"
]