[
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: destroy()] [Resource Leak] destroy() returns Element after destructuring Cell. If Element is Coin<T> and calling code aborts after destroy() but before transferring coin, are coins permanently lost, and can attacker intentionally trigger this to drain vault reserves? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Drop Safety] If Element type has drop ability and set() returns old_element that gets dropped in calling code, are resources properly cleaned up? For Cell<AccountCap>, does dropping old cap invalidate Navi lending operations in progress? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Module] [Error Handling] No error codes or custom errors defined. When get()/destroy() panic on None element, error messages are generic from option module. Can this make debugging vault issues difficult and hide attack vectors where cells are intentionally corrupted? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: get()] [Validation] get() doesn't validate element existence before borrow. If this pattern is used in vault emergency pause logic that checks Cell<PauseFlag>, can corrupted pause cell cause inability to pause protocol during attacks? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: new()] [Memory Safety] If new() is called with extremely large Element (e.g., Cell<vector<Coin<SUI>>> with 10000 coins), can this cause memory exhaustion and DoS when vault operations iterate over cell contents via get()? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Struct: Cell<Element>] [Storage Cost] Cell adds Option wrapper overhead. If vault uses Cell<T> for all state variables unnecessarily, does increased storage cost enable economic DoS where attackers create many cells causing protocol insolvency? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Flash Loan] If Cell<Balance<SUI>> tracks available liquidity and set() allows temporarily swapping with large balance during flash loan, can attacker manipulate liquidity checks in vault operations to bypass withdraw limits? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Integration] If Navi adaptor stores Cell<AccountCap> and destroy() is called to extract cap for repayment, but cap was already moved via set(), does panic brick entire vault preventing all Navi operations and withdrawals? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Integration] If Cetus position IDs are tracked in Cell<ID> and set() updates position during rebalance, can old position ID leak if not properly released, causing duplicate position tracking and incorrect vault valuation? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Integration] If reward distribution uses Cell<RewardPool> and get() provides reference for reward calculation while set() updates pool mid-calculation, can users claim inflated rewards due to reading inconsistent state? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Integration] If LST stake pool stores Cell<SupplyInfo> with total_supply and get() is used in ratio calculation while set() updates supply, can ratio calculation overflow/underflow causing incorrect LST minting amounts? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Front-running] If set() is called in public function to update Cell<OraclePrice> and attacker observes pending transaction, can they front-run with deposit/withdrawal at stale price before set() completes, extracting value from price slippage? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: destroy()] [MEV] If vault unwinding operation calls destroy() on multiple Cell<Position> objects and one destroy() fails due to None, entire transaction reverts. Can MEV bots exploit this by watching for partial unwind attempts and sandwich attack successful retry? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: get()] [Information Leak] get() returns reference allowing read access. If Cell<PrivateVaultState> contains sensitive strategy parameters and get() is called in public view function, can competitors extract alpha by reading cell contents? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Struct: Cell<Element>] [Sui Object Model] Cell has 'store' but not 'key', so it cannot be owned object. If Cell<AdminCap> must be stored in shared VaultRegistry object, does shared access enable MEV attacks where multiple operators race to call set() for privilege escalation? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: get()] [Sui Borrowing] get() returns &Element which creates immutable borrow of cell. If vault code holds this reference across transaction boundaries or in complex call chains, can borrow checker be fooled allowing simultaneous mutable access via set()? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Sui Transaction Effects] set() modifies cell in-place with &mut reference. If Cell is part of shared object and multiple transactions call set() simultaneously, does Sui's transaction ordering ensure consistency, or can race conditions corrupt vault state? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Invariant Break] If vault invariant is 'Cell<OperationStatus> must be Normal before deposits', and attacker calls set() to force status change without proper authorization checks, can they bypass operation status gating to deposit during emergency shutdown? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: destroy()] [Incomplete Cleanup] If Cell<LendingObligation> is destroyed to close position but destroy() just returns obligation without calling protocol's close_obligation, can this leave zombie obligations consuming vault credit limits? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: new()] [Duplicate Creation] If multiple modules can call new() to create Cell<GlobalConfig> without singleton pattern enforcement, can conflicting configs coexist causing vault operations to use wrong fee rates based on which cell is referenced? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Balance Manipulation] If Cell<u64> tracks user's share balance and set() swaps with attacker-controlled new_balance without checking old_balance == expected, can this enable share inflation attacks where attacker increases their shares without depositing? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: get()] [Stale Data] If Cell<LastUpdateEpoch> tracks when vault assets were valued and get() returns stale epoch during multi-block operation, can this cause loss tolerance checks to pass incorrectly allowing excessive losses? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: destroy()] [Fee Bypass] If Cell<AccruedFees> is destroyed to extract fees for distribution but destroy() doesn't validate fees were correctly calculated, can attacker destroy cell with manipulated fee amount to steal from fee pool? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: set()] [Capability Theft] If Cell<OperatorCap> is accessible via shared object and set() is called to swap operator cap, can attacker extract old cap from return value gaining operator privileges while new cap is installed? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/suilend/sources/cell.move] [Function: destroy()] [Privilege Escalation] If privileged operation requires destroying Cell<AdminCap> to verify admin authority but destroy() just returns cap without consuming it, can same cap be reused across multiple privileged calls enabling unauthorized config changes? (Critical)"
]