[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Health Limiter Coordination] The actuate() function doesn't notify the Health Limiter adaptor about guardian queue changes. Can this cause health factor checks to use stale guardian queue assumptions, leading to incorrect leverage limits or failed health checks in Navi lending operations? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [LST Stake Pool Impact] The run() function can change the guardian queue used for SUI price feeds that affect LST ratio calculations. Can this impact Volo's liquid staking pool's stake/unstake operations if the new guardian queue provides different price data, causing incorrect SUI<>LST conversion rates? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Concurrent State Mutations] The run() function modifies shared State without any locking mechanism. If another action (like set_oracle_queue_id_action) runs concurrently, can this lead to race conditions or state inconsistencies where guardian_queue and oracle_queue end up in incompatible configurations? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Success Verification] The actuate() function calls on_demand::set_guardian_queue_id but doesn't verify that the mutation actually succeeded. In edge cases where the package(package) visibility or module constraints prevent the mutation, could the event be emitted without the state actually changing? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Upgrade Path Vulnerability] The run() function doesn't include any version checks or upgrade compatibility logic. If the on_demand module is upgraded with a different State structure, can this action module continue to function correctly, or could it cause state corruption? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Error Handling Gap] The actuate() function has no error handling or rollback logic if the event emission fails. While Sui Move's transaction model provides atomicity, could there be edge cases in event processing that leave the system in a partially updated state? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Rate Limiting] The run() function has no rate limiting or cooldown period between guardian queue changes. Can an attacker with admin access rapidly cycle through different guardian queues to confuse monitoring systems, hide malicious changes, or cause DoS through excessive state mutations? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [No Test Coverage Indicators] The module has no test function indicators or assertions. Without comprehensive test coverage, have all edge cases been properly tested, including guardian queue changes during active oracle operations, with zero addresses, with non-existent IDs, and under concurrent access scenarios? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Sanity Checks] The run() function performs no sanity checks on the guardian_queue_id parameter (not zero, not equal to oracle_queue, not equal to current value, object exists, correct type). Can the absence of these basic sanity checks lead to trivial configuration errors that break the oracle system? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Event Ordering Race] The actuate() function reads the old guardian_queue value first, then mutates, then emits event. In a high-throughput scenario with multiple state-reading operations happening concurrently, could there be a window where external observers see the new guardian_queue value but haven't processed the GuardianQueueIdSet event yet, causing synchronization issues? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [AdminCap Holder Identity] The run() function uses '_' to ignore the AdminCap parameter, not capturing or logging which specific admin made the change. Can this lack of attribution make it impossible to trace which admin was responsible for a malicious or erroneous guardian queue change during security incident investigations? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [Single Responsibility Violation] The module combines validation (empty), state mutation, and event emission in a single action flow. Should these concerns be separated to allow for more flexible authorization models, such as a propose-approve-execute pattern for critical parameter changes? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: validate()] [Technical Debt] The empty validate() function represents technical debt that could be exploited if developers assume validation is present but never implemented. Has there been a security assessment acknowledging this validation gap, and are there compensating controls elsewhere in the system? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Guardian Queue Compatibility Check] The actuate() function doesn't verify that the new guardian queue uses compatible validation algorithms, signature schemes, or consensus mechanisms as expected by oracle feed consumers. Can incompatibility between guardian queue implementations cause oracle validation failures or security vulnerabilities? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Epoch Boundary Checks] The run() function allows guardian queue changes at any time without checking epoch boundaries. In Sui's epoch-based model, should guardian queue changes be restricted to epoch boundaries to avoid mid-epoch state inconsistencies affecting oracle feeds and DeFi protocol operations? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Notification Mechanism] The actuate() function changes the guardian queue without notifying dependent oracle queues or downstream consumers. Can this lack of notification cause oracle queues to continue using old guardian validation logic, creating a split where some components see the new guardian queue and others don't? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Minimum Guardian Requirements] The run() function doesn't enforce minimum requirements for the guardian queue (minimum number of guardians, stake threshold, reputation score). Can an admin set a guardian queue with too few guardians or insufficient stake, reducing the security of oracle validation below acceptable thresholds? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [State Object Version] The actuate() function doesn't check the State object's version or schema. If the State structure has been upgraded but this action module hasn't, can field access cause runtime errors or access wrong memory offsets, corrupting the State? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Module: set_guardian_queue_id_action] [No Access Control Hierarchy] The module has a flat authorization model with only AdminCap. Should there be a hierarchy of roles (super-admin, guardian-admin, operator) where guardian queue changes require super-admin permissions separate from other admin operations? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Impact Assessment Before Change] The run() function immediately applies the guardian queue change without any pre-change impact assessment. Should there be a dry-run or simulation mode that shows how many oracle feeds would be affected before committing to the change? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [Guardian Queue Lifecycle] The actuate() function doesn't check if the new guardian_queue_id points to an active, non-deprecated guardian queue. Can setting a deprecated or sunset guardian queue cause all subsequent oracle validations to fail or use outdated validation logic? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [Cross-Chain Bridge Impact] If the oracle system supports cross-chain operations, does changing the guardian queue affect cross-chain price feed bridges, and can this create arbitrage opportunities or price inconsistencies between chains? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: actuate()] [No Transaction Context] The actuate() function doesn't capture or validate transaction context (sender, epoch, timestamp). Can this make it difficult to enforce policies like 'guardian queue can only be changed once per epoch' or 'changes must be proposed 24h before execution'? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/actions/state/set_guardian_queue_id_action.move] [Function: run()] [No Whitelist/Blacklist] The run() function has no whitelist of approved guardian queues or blacklist of known-bad guardian queues. Can an admin accidentally or maliciously set a guardian queue that was previously identified as compromised or malicious? (High)"
]