[
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Authorization Vulnerability] Can the treasury cap transferred to ctx.sender() during initialization be front-run by an attacker who deploys the module first, gaining full minting control over SPRUNGSUI tokens with no recovery mechanism? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Centralization Risk] Does the unrestricted transfer of treasury cap to a single address (ctx.sender()) without multi-sig or timelock create a single point of failure where the deployer can mint unlimited SPRUNGSUI tokens, inflating supply and devaluing existing holders? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Missing Access Control] Are there any mechanisms in place to prevent the treasury cap holder from maliciously or accidentally minting arbitrary amounts of SPRUNGSUI tokens after deployment, potentially breaking the 1:1 peg with staked SUI? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Supply Cap Vulnerability] Does the absence of any max_supply parameter in coin::create_currency() allow unlimited SPRUNGSUI minting, enabling the treasury holder to inflate supply beyond actual staked SUI collateral? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Metadata Immutability] Can the empty symbol (b",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Decimal Precision Risk] Does the hardcoded 9 decimals match the expected precision for SUI-based calculations throughout the Volo protocol, or could mismatches lead to rounding errors in stake/unstake operations? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Treasury Cap Loss] If the ctx.sender() address loses access to its private keys after deployment, is there any recovery mechanism for the treasury cap, or would the protocol lose the ability to mint/burn SPRUNGSUI permanently? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Missing Burn Capability] Does the protocol have mechanisms to burn SPRUNGSUI tokens during unstaking, or does the treasury cap holder need to implement custom burn logic that could be bypassed or misconfigured? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Reentrancy in Deployment] Can the public_transfer of treasury cap be exploited if the recipient address is a malicious contract that performs reentrancy during the transfer callback, potentially manipulating the initialization state? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Metadata Modification] After metadata is shared as public_share_object, can the original deployer or any other party modify the coin metadata (name, symbol, description), potentially enabling rugpull scenarios? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Icon URL Missing] Does the option::none() for icon_url parameter prevent proper token recognition in wallets and DEXs, making it easier for attackers to create fake SPRUNGSUI tokens with similar names? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Replay Attack] If the module is upgraded or redeployed, could an attacker replay the init transaction with the same witness to create duplicate SPRUNGSUI token types with conflicting metadata? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Treasury Cap Custody] Is there validation that ctx.sender() is a trusted protocol-controlled address and not an externally owned account vulnerable to key compromise, which would expose the entire SPRUNGSUI supply to theft? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Witness Pattern Bypass] Can an attacker create a malicious module with a duplicate SPRUNGSUI struct to bypass the one-time witness pattern and create unauthorized SPRUNGSUI tokens with different treasury holders? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Coordination with Stake Pool] Is there enforcement that only the legitimate stake_pool module can call mint/burn operations on the treasury cap, or can the treasury holder mint SPRUNGSUI without corresponding SUI collateral? (Critical)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Empty Symbol Field] Does the empty symbol field (b",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Empty Description Field] Can the empty description field (b",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Module Upgrade Risk] If the sprungsui module is upgraded, will the existing treasury cap remain valid, or could an upgrade invalidate treasury operations and freeze all SPRUNGSUI minting/burning? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Public Metadata Manipulation] Can malicious actors interact with the publicly shared metadata object to corrupt SPRUNGSUI token information in a way that affects protocol operations or user perception? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Treasury Cap Phishing] Could an attacker social engineer the deployer to transfer the treasury cap to a malicious address post-deployment, gaining complete control over SPRUNGSUI supply? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Decimal Mismatch with SUI] Since SUI uses 9 decimals and SPRUNGSUI also uses 9 decimals, are there edge cases in conversion logic where precision loss or overflow could occur during stake ratio calculations? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Missing Pause Mechanism] Does the lack of any pause functionality in the token creation allow continued SPRUNGSUI minting even during protocol emergencies or security incidents? (Medium)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Treasury Cap Storage] Is the treasury cap stored in a secure, protocol-controlled object after transfer, or could it be transferred again by ctx.sender() to an insecure location? (High)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Initialization Race Condition] Can multiple transactions attempt to initialize the sprungsui module simultaneously, causing race conditions in treasury cap assignment or metadata creation? (Low)",
  "[File: volo-vault/local_dependencies/suilend_d/sprungsui/sources/sprungsui.move] [Function: init()] [Name Collision] Can the generic name 'Staked SUI' collide with other liquid staking derivatives on Sui, enabling confusion attacks or liquidity fragmentation? (Low)"
]