[
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Business Logic: Asset Whitelist] If vault whitelists assets based on working oracle feeds, can attacker add asset with problematic price feed (negative price, positive expo) to DoS vault operations or force unfavorable asset de-listing? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Business Logic: Emergency Mode] If vault enters emergency mode and switches to unsafe oracle functions for speed, can attackers exploit the window to perform operations at stale favorable prices before normal mode resumes? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Business Logic: Fee Calculation Timing] If vault calculates performance fees based on oracle prices at epoch boundaries, can operators manipulate oracle function choice at snapshot time to show inflated/deflated performance? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Business Logic: Share Price Oracle] If vault's share price (for external DeFi integrations) is based on oracle-priced assets, can attackers flash-crash the share price by exploiting oracle lag, then buy shares cheap and wait for correction? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_info_object_id()] [Address Conversion Security] Line 62-63 converts address to bytes then to ObjectID. If sui::address::to_bytes() encoding differs from expected, can this cause object ID mismatch, querying wrong price feeds? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_identifier_to_vector()] [Identifier Length] Returns vector<u8> identifier. If downstream code assumes fixed length but Pyth changes format, can variable-length identifiers cause buffer issues or indexing errors in vault's asset mapping? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [No Price Confidence] Pyth provides price confidence intervals but adaptor doesn't expose them. If price has wide confidence band (high uncertainty), can vault unknowingly use unreliable prices for critical decisions? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [No EMA Price] Pyth provides exponential moving average prices for smoothing. Adaptor only uses spot prices. During manipulation, can attackers benefit from spot price spikes while EMA would show attack? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_native()] [Price Status Ignored] Pyth price objects have status field (trading/halted/unknown). Adaptor doesn't check status. Can vault use prices from halted markets, enabling exploitation of frozen prices while real market moves? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_unsafe_native()] [No Confidence Check] Without timestamp validation, also skips confidence interval checks. Can attacker use moment of extreme price uncertainty (wide confidence) to execute operations at favorable tail of confidence range? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [Pyth Upgrade Compatibility] If Pyth network upgrades price feed format or adds new validation, existing adaptor may become incompatible. Can this create state where vault's oracle calls fail, freezing operations until adaptor upgrade? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [Price Feed Migration] If Pyth deprecates old price feeds and requires migration to new IDs, adaptor has no migration logic. Can this orphan vault assets using old feeds, making them unpriceable? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_info_object_id()] [Object ID Stability] If Pyth changes how price_feed_id maps to object IDs across upgrades, cached mappings become stale. Can this cause vault to query wrong objects or fail operations? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [Backward Compatibility] No version checks for Pyth modules. If Pyth makes breaking changes to i64, price, or state modules, can adaptor silently use wrong data structures, corrupting price extraction? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Cross-Module: Navi Limiter] If navi_limiter calls get_price_unsafe_to_target_decimal() for health checks (to avoid clock dependency), does this bypass Pyth's staleness validation, enabling health check manipulation via stale prices? (Critical)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Cross-Module: Vault Adaptors] If Navi/Suilend/Cetus adaptors each choose different oracle functions (safe vs unsafe) for asset pricing, can attacker exploit inconsistent pricing across adaptors to arbitrage or manipulate collateral ratios? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Cross-Module: Request Buffers] If deposit request validation uses safe oracle but execution uses unsafe, can attacker submit request with current prices then execute after favorable price movement using stale prices, profiting from the lag? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Cross-Module: Fee Config] If fee_config module calculates fees using oracle prices and adaptor choice varies by operation type, can operators systematically choose unsafe (stale favorable) prices for fee calculations? (High)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Cross-Module: Validator Rewards] If liquid staking reward distribution uses oracle-priced assets and adaptor allows stale prices, can operators inflate rewards by using old high prices or deflate by using old low prices? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [No Price Staleness Events] Functions don't emit events when returning prices. If price is critically stale (hours old) but within Pyth tolerance, can external monitors detect this before exploitation? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [No Function Usage Tracking] No distinction in output whether safe or unsafe function was called. Can vault auditors detect if unsafe functions are being misused without examining all caller code? (Low)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_unsafe_native(), get_price_unsafe_to_target_decimal()] [No Warning Mechanism] Unsafe functions have no capability requirement or warning. Can developers accidentally use them thinking they're equivalent to safe versions? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Module: adaptor_pyth] [No Price Deviation Checks] No validation that price hasn't moved beyond threshold since last read. Can gradual staleness accumulate undetected if each individual read seems reasonable? (Medium)",
  "[File: volo-vault/local_dependencies/protocol/oracle/sources/adaptor_pyth.move] [Function: get_price_native()] [Clock Dependency Cost] Requires Clock object passed. If vault operations need prices for many assets, does repeated Clock passing increase gas costs significantly, incentivizing use of unsafe no-clock functions? (Low)"
]