[
  "[File: liquid_staking/sources/validator_pool.move] [Constants: MAX_TOTAL_WEIGHT] MAX_TOTAL_WEIGHT is 10,000 at line 31 - this is checked in set_validator_weights at line 349, but could accumulated weights from DEFAULT_WEIGHT assignments exceed this over time? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Constants: ACCEPTABLE_MIST_ERROR] ACCEPTABLE_MIST_ERROR is 10 at line 32 - this is used in two places (lines 483, 757) for tolerance, but are both uses compatible, or could one operation's tolerance interfere with another's invariants? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Constants: DEFAULT_WEIGHT] DEFAULT_WEIGHT is 100 at line 33 - new validators get this weight at line 868, but is this always appropriate, or could it cause imbalance if added when total_weight is very different? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Constants: ACTIVE_STAKE_REDEEM_OFFSET] ACTIVE_STAKE_REDEEM_OFFSET is 100 at line 34 - this offset is added at line 610, presumably to account for rounding, but is 100 mist the right amount, or could it be exploited? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: ENotEnoughSuiInSuiPool] Error 40000 at line 16 is asserted at line 762 - are there any other code paths that should check for sufficient sui_pool balance but don't, potentially causing unexpected failures? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: ENotActiveValidator] Error 40001 at line 17 is asserted at line 853 when adding validators - but this check is only at addition time, not during refresh when validators might become inactive - is this sufficient? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: ETooManyValidators] Error 40002 at line 18 is checked at line 341 in set_validator_weights - but is the check done before or after rebalance operations that might add validators? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EValidatorAlreadyExists] Error 40003 at line 19 is checked at line 847-848 - but the check is for validator_address, not staking_pool_id - could two different pool IDs have the same validator address, bypassing this check? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EValidatorNotFound] Error 40004 at line 20 is asserted at line 519 - are there other operations that assume a validator exists without checking, that should use this error? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EInvalidValidatorWeight] Error 40005 at line 21 is used at line 375 in verify_validator_weights - but this verification happens AFTER rebalance, so does this error ever actually trigger, or is it unreachable? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EInvalidValidatorWeightSum] Error 40006 at line 22 is asserted at line 388 - similarly, if rebalance() has already executed, how could the weight sum be wrong, or is this catching internal logic errors? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EInvalidValidatorSize] Error 40007 at line 23 is asserted at line 389 - this checks match_num == non_zero_weights_count, but what exact scenario would cause these to differ? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: EMaxTotalWeight] Error 40008 at line 24 is checked at line 349 - is this check redundant with the weight validation in verify_validator_weights, or does it catch a different case? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Error: ETotalSuiSupplyChanged] Error 40009 at line 25 is asserted at line 483 with ACCEPTABLE_MIST_ERROR tolerance - but why is this check only in rebalance() and not in other operations that modify total_sui_supply? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.sui_pool] The sui_pool field at line 39 is a Balance<SUI> buffer - could this buffer grow unboundedly if stake operations fail, causing memory or value locking issues? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.validator_infos] The validator_infos vector at line 41 has no explicit size limit enforcement beyond MAX_VALIDATORS check in set_validator_weights - could validators accumulate past this limit through other paths? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.total_sui_supply] The total_sui_supply field at line 44 is supposed to equal sum(validator_infos.total_sui_amount) + sui_pool per comment at line 43 - is this invariant actively enforced or just documented? (High)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.last_refresh_epoch] The last_refresh_epoch field at line 46 is used to prevent double-refresh at line 187 - but could this cause issues if transactions are reordered or if the epoch changes mid-transaction? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.total_weight] The total_weight field at line 48 is sum of all validator assigned_weight values - is this sum recalculated and verified periodically, or could it drift due to bugs? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.manage] The manage field at line 50 is checked via manage.check_version() at lines 180 and 338 - but what version checks are being performed, and could version mismatches cause security issues? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorPool.extra_fields] The extra_fields Bag at line 52 is for future-proofing - are there any security implications of allowing arbitrary data storage here, could it be exploited for griefing or storage attacks? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorInfo.staking_pool_id] The staking_pool_id field at line 57 uniquely identifies the validator's pool - is this ID validated to match the validator_address, or could they be inconsistent? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorInfo.validator_address] The validator_address field at line 58 is checked for uniqueness at line 847 - but is this check sufficient if the same validator operates multiple pools? (Low)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorInfo.active_stake] The active_stake Option<FungibleStakedSui> at line 59 can be None - are all operations that access this field properly checking is_some() before borrowing to prevent panics? (Medium)",
  "[File: liquid_staking/sources/validator_pool.move] [Struct: ValidatorInfo.inactive_stake] The inactive_stake Option<StakedSui> at line 60 similarly can be None - same concern about None-checking? (Medium)"
]