[
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_u32()] [Endianness Confusion] Can an attacker exploit the big-endian byte reversal to create hash collisions by crafting u32 values that produce identical hashes after reversal, potentially allowing oracle update message replay or signature reuse across different intended values? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_u64()] [Endianness Manipulation] If push_u64() reverses bytes for big-endian but callers expect little-endian, can timestamp values in generate_update_msg() be misinterpreted, allowing stale oracle data to pass validation by timestamp confusion? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_u32() vs push_u32_le()] [Endianness Mixing] Can mixing big-endian push_u32() and little-endian push_u32_le() in message construction create ambiguous hash inputs where the same logical value produces different hashes depending on function choice, breaking signature verification invariants? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_u64() vs push_u64_le()] [Byte Order Attack] In generate_update_msg() where push_u64_le() is used for max_variance and timestamp, can an attacker craft payloads that exploit endianness differences to bypass max_variance checks while maintaining valid signatures? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_u128()] [Large Integer Endianness] Does the byte reversal in push_u128() create vulnerabilities when hashing 128-bit values where specific byte patterns after reversal could collide with other reversed patterns, enabling oracle price manipulation? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_i128()] [Two's Complement Overflow] When computing two's complement as 'u128::max_value!() - value + 1', can integer overflow occur if value equals 0 and neg is true, potentially causing incorrect hash computation for negative zero in oracle price feeds? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_i128()] [Negative Value Boundary] Can an attacker exploit the boundary condition where value equals u128::max_value!() with neg=true, causing the two's complement calculation to underflow or wrap, producing unexpected hash values for extreme negative oracle prices? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_i128_le()] [Signed Zero Ambiguity] Since push_i128_le() uses the same two's complement logic, can the representation of negative zero (value=0, neg=true) differ from positive zero (value=0, neg=false), creating distinct hashes for mathematically equivalent values and breaking oracle consensus? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_i128()] [Sign Bit Manipulation] If neg flag is incorrectly set during Decimal unpacking, can positive values be hashed as negative (or vice versa), allowing oracle data to be misrepresented while maintaining valid cryptographic signatures? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_i128_le()] [Two's Complement Endianness] Does the little-endian variant create different two's complement representations than big-endian, potentially causing the same signed value to produce different hashes depending on which function is called? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_decimal()] [Decimal Unpacking Trust] Since push_decimal() directly unpacks Decimal without validation, can malformed Decimal values with inconsistent sign flags or magnitude bypass oracle price validation by producing valid hashes for invalid price data? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_decimal_le()] [Precision Loss] When push_decimal_le() unpacks and hashes Decimal values, can precision loss or rounding errors in the Decimal representation cause the hash to differ from the actual value used in vault calculations, creating oracle-vault value mismatches? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Decimal Scale Confusion] If the Decimal value in generate_update_msg() has different scale/exponent than expected by vault consumers, can the hash remain valid while the interpreted price value differs, enabling price manipulation attacks? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_decimal()] [Sign Flag Injection] Can an attacker inject a Decimal with an incorrect neg flag that gets hashed via push_decimal(), allowing negative prices to be signed as positive or vice versa, breaking vault collateral calculations? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Field Ordering Dependency] Since generate_update_msg() constructs messages in a specific order (queue_key, feed_hash, value, slothash, max_variance, min_responses, timestamp), can reordering these fields while maintaining the same hash allow oracle data substitution or replay attacks? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Message Boundary Ambiguity] Can an attacker craft inputs where the concatenated byte boundaries in generate_update_msg() are ambiguous, such that different logical messages produce the same hash due to lack of field separators or length prefixes? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_attestation_msg()] [Attestation Field Collision] In generate_attestation_msg(), can carefully crafted inputs cause field boundaries to overlap (e.g., end of mr_enclave bleeding into start of slothash), creating hash collisions that allow unauthorized oracle attestations? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Fixed-Length Assumption] Since queue_key, feed_hash, and slothash are asserted to be 32 bytes, can an attacker exploit this fixed-length assumption by prepending/appending data to other variable-length fields to create collision attacks? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_attestation_msg()] [Secp256k1 Key Padding] With secp256k1_key required to be exactly 64 bytes, can padding or compression schemes create multiple valid representations of the same key that produce different hashes, breaking oracle identity verification? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Queue Key Length Bypass] Can the assertion 'queue_key.length() == 32' be bypassed by providing a vector that appears to have length 32 but contains malicious padding or control characters, allowing unauthorized queue access? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Feed Hash Truncation] If feed_hash length validation fails, does the error abort cleanly, or can partial message construction expose buffer state or allow timing attacks to leak valid feed hashes? (Low)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_update_msg()] [Slothash Zero Padding] Can an attacker provide a slothash with leading/trailing zeros that passes the 32-byte check but represents a different logical value, allowing slot number manipulation in oracle updates? (Medium)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_attestation_msg()] [Oracle Key Collision] Can two different oracle identities produce the same 32-byte oracle_key through hash collision, allowing one oracle to impersonate another when generating attestation messages? (High)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: generate_attestation_msg()] [MR Enclave Validation Gap] Does the 32-byte length check for mr_enclave verify that it represents a valid SGX measurement, or can arbitrary 32-byte values be used to forge trusted execution attestations? (Critical)",
  "[File: volo-vault/local_dependencies/switchboard_sui/on_demand/sources/utils/hash.move] [Function: push_bytes()] [Buffer Append Race] If push_bytes() is called multiple times with overlapping or aliased vectors, can buffer.append() create corruption or duplicate data in the hash input, breaking message integrity? (Medium)"
]